// ==UserScript==
// @name         Qually Sell-Rewrite
// @version      2.0
// @namespace    http://tampermonkey.net/
// @description  Выкуп ЗП, продажа и переименовка
// @author       https://vk.com/botqually
// @match        www.howrse.com/*
// @match        us.howrse.com/*
// @match        www.howrse.co.uk/*
// @match        au.howrse.com/*
// @match        ca.howrse.com/*
// @match        www.howrse.de/*
// @match        ouranos.equideow.com/*
// @match        gaia.equideow.com/*
// @match        www.caballow.com/*
// @match        www.howrse.com.pt/*
// @match        br.howrse.com/*
// @match        www.howrse.co.il/*
// @match        www.lowadi.com/*
// @match        www.howrse.it/*
// @match        nl.howrse.com/*
// @match        www.howrse.se/*
// @match        www.howrse.pl/*
// @match        www.howrse.cz/*
// @match        www.howrse.dk/*
// @match        www.howrse.fi/*
// @match        www.howrse.no/*
// @match        ar.howrse.com/*
// @match        www.howrse.hu/*
// @match        www.howrse.ro/*
// @match        www.howrse.bg/*
// @match        www.howrse.si/*
// @match        www.howrse.sk/*
// @require      https://unpkg.com/popper.js@1/dist/umd/popper.min.js
// @require      https://unpkg.com/tippy.js@4
// ==/UserScript==

var maleNames = "Ааран,Аарен,Ааррон,Аб,Аббат,Абботт,Абей,Абелл,Абель,Абнар,Абнер,Абнор,Абот,Аботт,Абрам,Абран,Абрахам,Абсалон,Аверилл,Адам,Аддам,Аддисон,Аден,Адисон,Адиссон,Адлэй,Адней,Адольф,Адриан,Адэйр,Адэр,Азия,Азэлстан,Айбл,Айзек,Айк,Ак,Акей,Акерлеа,Акерлей,Акерли,Аки,Аклеа,Аклей,Акли,Актон,Акэль,Алан,Аластеир,Аластэйр,Алвар,Алвен,Алви,Алвин,Алвис,Алгар,Алджернон,Алеистер,Алек,Алекс,Александр,Ален,Алестер,Алжир,Алик,Аликс,Алисандр,Алисдэйр,Алиссандр,Алистер,Алистэйр,Аллан,Аллен,Аллин,Аллистер,Аллистир,Аллистэйр,Алтон,Алф,Алфонзо,Алфорд,Алфрид,Альберт,Альдина,Альпин,Альтаир,Альфа,Альфи,Альфред,Алэйстер,Алэйстэйр,Амби,Амброуз,Амедеус,Амиас,Амори,Амос,Амьяс,Анакин,Ангел,Ангес,Андерсон,Анджелл,Анж,Анском,Анскомб,Ансон,Антван,Антуан,Арден,Арик,Арил,Арин,Аркелл,Арли,Арман,Арн,Арне,Арни,Арнольд,Арран,Аррин,Аррон,Арт,Арти,Артур,Арчи,Арчибальд,Аселет,Аселин,Асер,Астон,Афтон,Аффтон,Ачилл,Аш,Ашер,Аштон,Бад,Бадди,Баз,Базилик,Байрон,Байярд,Бак,Бакстер,Балдер,Балдрик,Бамби,Баптист,Бардолф,Барии,Барклей,Барнабас,Барни,Барнэби,Барретт,Барри,Барт,Бартоломей,Бассетт,Бастер,Бастиан,Батч,Беван,Беверли,Бевис,Бедивир,Бейб,Бейлей,Бейлие,Бен,Бенджамин,Бенджи,Бенедикт,Бенет,Беннетт,Бенни,Бенние,Бенсон,Бентлей,Бентон,Беорегард,Бердт,Беренгар,Беренджер,Берет,Бернард,Берни,Берри,Берт,Берти,Бертон,Бертрам,Бертран,Бивис,Билл,Билли,Бисш,Биф,Блейн,Близэ,Блисс,Блэйз,Блэйк,Блэйн,Блэр,Боб,Бобби,Болдуин,Боллард,Бомонт,Бонифэйс,Борис,Брадлей,Браеден,Брайен,Брайон,Бранден,Брандон,Браннон,Брейден,Брейдн,Брендан,Бренден,Брендон,Бреннан,Брент,Брентон,Брет,Бретт,Бриар,Брион,Брис,Бриско,Бриттон,Бриэм,Бродерик,Броди,Броз,Брок,Бронт,Броуди,Броук,Брук,Брукс,Бруно,Брутус,Брьянт,Брэд,Брэди,Брэдфорд,Брэйден,Брэйди,Брэм,Брэн,Брюс,Брююс,Буз,Букер,Бью,Бэйли,Вал,Валентайн,Вард,Ваухан,Вашингтон,Вебстер,Велдон,Вер,Верджил,Верн,Вернон,Вестер,Вестлей,Вестон,Вик,Виктор,Вил,Вилберн,Вилей,Вилки,Вилл,Вилли,Виллоби,Вилмар,Вилмер,Вилмот,Вилсон,Вилф,Вилфорд,Вильтон,Вин,Виндзор,Винни,Винс,Винсент,Винслоу,Винтроп,Вирджиль,Вистан,Витейкр,Витней,Воган,Вогн,Волдо,Волкер,Воллис,Вольф,Воспой,Вуди,Вудроу,Вулф,Вьятт,Вэйд,Вэйланд,Вэнс,Габби,Габриэль,Гай,Гайлс,Гален,Гамильтон,Гантэр,Гарван,Гарей,Гарланд,Гарнет,Гарольд,Гарри,Гарс,Гарфилд,Гас,Гваделупа,Гейб,Гейл,Гейр,Гектор,Ген,Генри,Герберт,Герман,Гидеон,Гильберт,Гисберт,Гладвин,Гланвилл,Глендауэр,Гленн,Глэн,Говард,Годвин,Годфри,Голлагэр,Голладжер,Гомер,Горд,Горден,Гордон,Граем,Грай,Гранвилл,Гранд,Грахэйм,Грег,Грей,Гренвилл,Гриир,Грир,Гриффин,Гриффит,Гровер,Грэг,Грэгори,Грэди,Грэм,Гудвин,Гудзон,Гэй,Гэйбл,Гэйг,Гэйдж,Гэйелорд,Гэйл,Гэйлон,Гэйлорд,Гэйр,Гэлл,Гэри,Давей,Дави,Дад,Дадда,Дадли,Даймонд,Дакей,Дакота,Дакс,Далтон,Дамайон,Дамиан,Дана,Дани,Данки,Данни,Дарби,Дарвин,Дарден,Дарен,Дариан,Дарил,Дарин,Дарки,Дарнелл,Даррел,Даррен,Даррил,Даррин,Даррэль,Д'артагнан,Дасти,Дастин,Дау,Дафф,Даффи,Дашилл,Дван,Двэйн,Деай,Деван,Девен,Девереукс,Девин,Девон,Дейв,Дейл,Дейрлл,Дейрн,Деклан,Декстер,Делберт,Делл,Делмар,Делрой,Деметриус,Демон,Ден,Денвер,Денеб,Дензэль,Дени,Денил,Деннис,Дентон,Деон,Деонн,Деонт,Дерби,Дерек,Дерик,Дермот,Дерок,Деррен,Дерри,Деррил,Дефорест,Дефоррест,Дешон,Джадд,Джадин,Джай,Джайлс,Джак,Джамар,Джамей,Джамисон,Джарвис,Джаред,Джарод,Джарред,Джарретт,Джаррод,Джаспер,Джасти,Джастин,Джеб,Джед,Джедидиа,Джейдн,Джейк,Джейлн,Джейми,Джеймс,Джейрт,Джейсон,Джекки,Джекоб,Джем,Дженкин,Джеп,Джер,Джералд,Джеральд,Джерард,Джерваз,Джервис,Джереми,Джери,Джермэйн,Джеролд,Джером,Джеррард,Джерред,Джерри,Джеррод,Джерролд,Джес,Джесси,Джетро,Джетт,Джеф,Джеффери,Джефферсон,Джеффрей,Джеффри,Джиб,Джид,Джиди,Джил,Джим,Джими,Джимми,Джисберт,Джиффард,Джо,Джоб,Джоби,Джоджо,Джоди,Джозеф,Джой,Джойс,Джон,Джоназан,Джоназон,Джонасон,Джонатан,Джоней,Джони,Джонни,Джонти,Джорги,Джордан,Джордж,Джорди,Джордон,Джосс,Джоул,Джош,Джошоа,Джошуа,Джулс,Джульян,Джустис,Джьюд,Джэй,Джэйд,Джэйда,Джэйден,Джэйдон,Джэйкоб,Джэйлен,Джэйлин,Джэйлон,Джэймес,Джэйсон,Джэксон,Джэмини,Джэмми,Джэн,Ди,Диакон,Дигби,Диггори,Дигори,Дизон,Дик,Дики,Дикки,Дил,Дилан,Дилберт,Димер,Дин,Диндр,Дирк,Доб,Додж,Дольф,Дом,Доменик,Доминик,Дон,Дональд,Донни,Донован,Дор,Дориан,Доусон,Драйк,Древ,Дрейвн,Дуайт,Дуан,Дуг,Дуги,Дуглас,Дункан,Дунстан,Дью,Дьюей,Дьюэйн,Дэвид,Дэвис,Дэй,Дэйви,Дэйн,Дэйтон,Дэн,Дэни,Дэниел,Дэнни,Дэррик,Дэшон,Дюк,Жюль,Завир,Зак,Закери,Зандер,Захарий,Зачариа,Зачэри,Зед,Зедекиа,Зек,Зубин,Зэофилус,Иб,Игнатиус,Ид,Иззи,Изидор,Имон,Инглеберт,Инграм,Инди,Индиана,Индиго,Инесент,Иниго,Иорик,Ирвайн,Ирвин,Ирвинг,Ирл,Ирнест,Иссак,Исси,Истер,Йорк,Ка,Кадмус,Каин,Каир,Кайд,Кайл,Кал,Каллен,Кам,Камден,Камрон,Карбрей,Карбри,Карвер,Карей,Карл,Карлайл,Карлейл,Карлин,Карлтон,Каррол,Картер,Касиди,Каспер,Кассиди,Квентин,Квинтин,Кеван,Кевин,Кей,Кейденс,Кейдн,Кейлб,Кеймрон,Кейси,Келвин,Келкей,Келл,Келли,Келсей,Кемп,Кен,Кендал,Кендол,Кендрик,Кенелм,Кензи,Кенит,Кеннеди,Кеннет,Кенни,Кеннит,Кенрик,Кент,Кентиджерн,Кентон,Кермит,Керней,Керр,Керри,Керт,Кертис,Кешон,Ки,Киаран,Килан,Килер,Килиан,Киллиан,Кимбелайн,Кимберли,Кимбол,Кимбэль,Кин,Кинан,Кинастон,Кинг,Кингслей,Кип,Киран,Кирби,Кирк,Кирон,Кирус,Кит,Китон,Киф,Клайв,Клайд,Кланкей,Кланки,Кларенс,Кларк,Клев,Клей,Клейтон,Клем,Клемент,Клемми,Клетис,Клетус,Кливленд,Клинт,Клинтон,Клифтон,Клифф,Клиффорд,Клод,Клэйрк,Клэр,Кодей,Коди,Коертней,Кола,Коламбан,Колберт,Колби,Колдер,Колин,Коллахан,Коллин,Коллум,Колтен,Колтон,Кольт,Конан,Конвей,Конлей,Коннелл,Коннер,Коннор,Конор,Конрад,Конфуций,Корбин,Корделл,Корей,Кори,Корнелиус,Кортней,Кортни,Корэй,Коти,Коул,Коулман,Крис,Криспиан,Криспин,Кристи,Кристиан,Кристопэр,Кристофер,Крофорд,Крофтон,Крэйг,Ксавайор,Ксавьер,Ксан,Ксзавир,Куин,Куинкей,Куинси,Куинтон,Купер,Курт,Куртис,Кэйд,Кэйдн,Кэйл,Кэйлб,Кэймрон,Кэйн,Кэйси,Кэлвин,Кэм,Кэмп,Кэмпбэл,Кэри,Лаверн,Лавлл,Лаз,Лайл,Лайонел,Лаки,Ланни,Ланфорд,Ларк,Ларкин,Ларри,Леви,Лейврн,Лейн,Лейтон,Лекс,Леланд,Лем,Лемми,Лемюэль,Лен,Ленард,Лени,Леннард,Ленни,Лео,Леон,Леонард,Леопольд,Лерой,Лес,Лесли,Лестер,Ли,Лии,Лин,Линдон,Линдсей,Линдси,Линкольн,Линн,Линсей,Линтон,Линус,Линфорд,Лирой,Лисандр,Литон,Лихнис,Ллойд,Ллью,Лльюелин,Лльюеллин,Ло,Ловэль,Лойд,Лон,Лондон,Лонни,Лонс,Лорен,Лоренс,Лори,Лорин,Лорни,Лоррин,Лосон,Лоуэлл,Лу,Лудо,Луи,Лукиан,Льюин,Льюис,Лэйк,Лэйн,Лэйтон,Лэндон,Лэнс,Лэрри,Людовик,Люк,Люкс,Лютер,Маверик,Мадисон,Майк,Майкл,Майлз,Майрон,Макей,Макензи,Маки,Макинтош,Маккензи,Макс,Максвелл,Малачи,Малком,Малоун,Манлей,Манни,Манникс,Марвин,Мариус,Марка,Марко,Маркус,Марлен,Марлин,Марлон,Марлоу,Мармадьюк,Марри,Марти,Мартиал,Мартин,Маршал,Маршалл,Масон,Мастерман,Матти,Мед,Мелвилль,Мелвин,Мельбурн,Мерв,Мервин,Мерди,Мердо,Мердок,Мередит,Мерит,Мерл,Мерлин,Меррилл,Мерритт,Мертон,Мерфи,Мид,Миид,Мик,Мика,Мики,Микки,Милберн,Миллард,Мило,Милтон,Милфорд,Митчелл,Мич,Мича,Мичил,Мо,Моз,Моисей,Молком,Монро,Монтагью,Монтгомери,Монти,Морган,Морген,Мордекэй,Морис,Морлей,Моррис,Морт,Морти,Мортимер,Мортон,Мосс,Моэ,Мулава,Мэйнард,Мэйнерд,Мэйор,Мэйсон,Мэйтланд,Мэлори,Мэль,Мэриан,Мэрион,Мэт,Мэтт,Мэтти,Мэтью,Назаниль,Найджел,Найлс,Нанди,Нат,Натан,Науэлл,Наш,Невада,Неван,Невил,Невилл,Нед,Нейл,Нейлл,Нейт,Нельсон,Нео,Нивек,Нивен,Ник,Никк,Никки,Николас,Нили,Нимбус,Ноа,Нолан,Нолл,Норберт,Норвуд,Норм,Норман,Норманд,Норрис,Нортон,Ноубль,Ноэль,Ньют,Ньютон,Оберон,Обин,Обри,Огастин,Огден,Огэст,Оделл,Одлей,Одран,Оззи,Океан,Олби,Олбэйн,Олдвен,Олдвин,Олден,Олдин,Олдис,Олдон,Олдос,Олдред,Олдус,Олдфорд,Олей,Оли,Оливер,Олластер,Олластир,Оллгар,Оллджер,Олли,Оллин,Оллисдэйр,Оллистер,Оллистэйр,Оллон,Оллэйстар,Омега,Ора,Оран,Орвал,Орвилл,Ориан,Ормерод,Оррелл,Оррин,Орсон,Осберт,Осбоерн,Осборн,Освальд,Осень,Оскар,Остен,Остин,Отис,Оттис,Оуин,Оуэн,Ошин,Пайс,Палмер,Панкрас,Паркер,Паррис,Пат,Патрик,Патси,Пеитон,Пепин,Перри,Перс,Перси,Персиваль,Петеркин,Пип,Пипер,Пирр,Пирс,Пит,Питер,Пол,Поли,Поликарп,Помпей,Портер,Престон,Приам,Принц,Проспер,Пэйс,Пэйси,Пэйтон,Равен,Раз,Раймонд,Раймунд,Райордан,Райт,Ралф,Ралфи,Ральф,Ранделл,Ранди,Рандолф,Рандольф,Расс,Рассел,Рассэль,Расти,Растус,Раян,Реарден,Реган,Редклиф,Редклифф,Редлей,Редд,Редж,Реджи,Реджинальд,Редманд,Редмонд,Реид,Рей,Рейли,Рейнард,Рейнольд,Рекс,Риган,Ригби,Рид,Ридлей,Риель,Рик,Рикей,Рики,Рилан,Рилей,Рили,Рио,Риплей,Рис,Рич,Ричард,Ричи,Роб,Робби,Роберт,Роби,Робин,Рован,Род,Роддж,Родджер,Родди,Родерик,Роджер,Родни,Родолф,Рой,Ройл,Ройс,Ройстон,Роки,Роланд,Роли,Ролланд,Ролли,Рон,Рональд,Ронни,Рори,Роско,Росс,Роуланд,Роулей,Роял,Рубен,Рубин,Руди,Рудольф,Рудьярд,Рхетт,Рьюб,Рэд,Рэй,Рэйнард,Рэйнер,Рэйф,Рэндал,Рэндалл,Савьер,Сайг,Саймон,Салал,Салливан,Самми,Сандфорд,Санни,Санфорд,Свизин,Свизун,Свиней,Себастьян,Севард,Седрик,Сеймур,Селби,Септембер,Сесил,Сет,Сефтон,Сивард,Сигманд,Сид,Сидней,Силас,Силвестр,Сильвер,Сильвестр,Симеон,Синклэйр,Сирил,Сисар,Скай,Скилар,Скилер,Скот,Скотти,Скуилер,Слай,Слэйд,Сони,Сонни,Спайк,Спарроу,Спенсер,Спиро,Стакей,Стаффорд,Стерлинг,Стеф,Сти,Стив,Стивен,Стиви,Стиу,Сторм,Сту,Стэки,Стэн,Стэнли,Стэнфорд,Стюарт,Сэм,Сэмюэль,Сэнди,Тад,Таддеус,Тай,Такер,Тал,Талбот,Таннер,Таскилл,Таффи,Тед,Тейгу,Тейдж,Тейрк,Текс,Тенней,Теннизон,Тео,Теобальд,Теодор,Теранс,Теренс,Терло,Терранс,Террелл,Терренс,Терстон,Ти,Тиарнак,Тиарнан,Тибалт,Тибби,Тигу,Тизон,Тилар,Тилер,Тилор,Тим,Тимми,Тимоти,Тирелл,Тирнан,Тирней,Тирон,Тироун,Тиррелл,Тоал,Тоби,Тобиас,Тобин,Тод,Тодд,Толли,Том,Томас,Томми,Тон,Тони,Топэр,Торлей,Торнтон,Травис,Тракей,Трантер,Траффорд,Траэрн,Трев,Тревельян,Тревор,Трейврс,Трейс,Трейси,Трент,Трентон,Тристрам,Трой,Труман,Тусон,Тэдди,Тэди,Тэйлер,Тэйлор,Тэйн,Тэйт,Тэл,Тэмпл,Тэрри,Уилбер,Уиллард,Уиллис,Уилфред,Уилфрид,Уильям,Уинстон,Уинфред,Уисдом,Улайксс,Улиссес,Уолли,Уоллис,Уолт,Уолтер,Уолтон,Уорик,Уорнер,Уоррен,Уот,Уоткин,Уптон,Урбан,Уриах,Уэйн,Уэсли,Фабиан,Фалк,Фарлей,Фарон,Фарран,Фелан,Фелиз,Феликс,Фелим,Фелис,Фентон,Ферги,Фергус,Ферд,Ферди,Фердинанд,Фестер,Фестус,Фидо,Фил,Филайп,Филандр,Филберт,Филип,Филипп,Фило,Финикс,Финис,Флемминг,Флечер,Флинн,Флинт,Флойд,Флорри,Флурри,Фок,Фокс,Фонз,Фонзи,Форбес,Форд,Форест,Форрест,Фостер,Фоук,Фразир,Франклин,Фред,Фредди,Фредерик,Фредрик,Фрейзер,Фрейзр,Фримэн,Фритс,Фродо,Фрэнк,Фрэнки,Фрэнклин,Фрэнс,Фрэнсис,Хавелок,Хадвин,Хадлей,Хал,Хам,Хамиш,Хамлет,Хаммонд,Ханк,Ханлей,Хантер,Харв,Харви,Харди,Хардинг,Харкоерт,Харлан,Харланд,Харлей,Харлин,Хармон,Харпер,Харрис,Харрисон,Хартлей,Хауелл,Хедлей,Хек,Хендерсон,Хендрик,Хенрай,Хенри,Херб,Херби,Хервей,Херлей,Хиацинт,Хилари,Хиллэри,Хирам,Хис,Хитклифф,Хию,Хоард,Хоб,Ходдж,Хойт,Холден,Холл,Холлис,Хомер,Хопкин,Хорас,Хоратайо,Хоуи,Худд,Хуей,Хует,Хукк,Хукслей,Хумберт,Хунтлей,Хуффи,Хью,Хьюберт,Хьюго,Хьюи,Хэвен,Хэдлей,Хэйвуд,Хэйден,Хэйл,Хэмфри,Хэппи,Хюи,Чад,Чадвик,Чаз,Чак,Чакки,Чарли,Чарлтон,Чарльз,Час,Чейз,Чендлер,Ченс,Черокез,Честер,Чеьянн,Чип,Чонки,Чонси,Ша,Шад,Шаи,Шайенн,Шакуилл,Шамус,Шан,Шаннен,Шаннон,Шау,Шеврон,Шелби,Шелдон,Шеллей,Шелтон,Шем,Шервуд,Шеридан,Шерлок,Шерман,Ши,Шилох,Шимус,Шолто,Шон,Шэй,Шэйн,Эбби,Эбен,Эбенезер,Эван,Эвелин,Эверард,Эверетт,Эверитт,Эвот,Эгберт,Эд,Эдан,Эдвард,Эдвин,Эдгар,Эдди,Эдисон,Эдмунд,Эдон,Эдун,Эзраа,Эзэлстан,Эзэлуолф,Эйб,Эйби,Эйвери,Эйден,Эйлберт,Эйлвард,Эймерей,Эймери,Эйнслей,Эйнсли,Эйс,Элайотт,Элбан,Элвин,Элвис,Элвуд,Элгар,Элдвен,Элдвин,Элден,Элджер,Элдин,Элдис,Элдон,Элдред,Элдус,Эли,Элиас,Элиджа,Элиот,Элла,Эллгар,Эллджер,Эллери,Эллиот,Эллис,Элмер,Элрик,Элрой,Элсдон,Эльберт,Эльтон,Эмерсон,Эмиль,Эммануель,Эммерсон,Эммет,Эмметт,Эмори,Эмэри,Энджелберт,Энди,Эндрю,Энтони,Эрван,Эрвин,Эрек,Эрик,Эрл,Эрн,Эрнест,Эрни,Эрон,Эррол,Эрролл,Этан,Этелберт,Этелред,Этелрик,Этелхард,Эшли,Эюзби,Юджин,Юлиан,Юлиус,Юниор,Юстас,Янкей,Янки,Ярвуд";
var femaleNames = "Аарен,Абагэйл,Абагэйль,Аббай,Аббей,Абби,Аббигаель,Аббигаиль,Аббигайл,Аббигаэль,Аббигейл,Аббигейль,Аббигэйл,Абегэйл,Абелла,Абигайл,Абигаэль,Абигол,Абигэйл,Абигэйль,Абиджил,Абичэйл,Абэйгаэль,Абэйгил,Ава,Авалайн,Авалина,Авалон,Авалона,Авелина,Аверилл,Агава,Агата,Аггай,Агджи,Агджая,Агнес,Агнус,Ада,Адайн,Адамайн,Адамина,Адаминна,Адди,Аддисон,Адела,Аделаида,Аделайн,Адели,Аделина,Аделис,Аделисия,Аделия,Аделл,Аделфа,Адель,Адена,Адин,Адисон,Адиссон,Адмиранда,Адоллина,Адреа,Адри,Адриа,Адриан,Адриана,Адрианн,Адрианна,Адрина,Адринна,Адрия,Адэлис,Адэна,Азалия,Азера,Азур,Айон,Айседора,Акация,Алана,Аланис,Аланна,Аланнис,Алвена,Алвилда,Алеа,Алекс,Алекса,Александра,Алексис,Алексия,Алексус,Алеса,Алета,Алетея,Алеша,Аливия,Ализ,Ализон,Аликс,Аликса,Алин,Алис,Алиса,Алисе,Алисия,Алисс,Алисса,Алиссия,Алисья,Алиш,Алиша,Алишия,Алли,Аллин,Аллисса,Алфреда,Альберта,Альвина,Альма,Альмира,Альфа,Амабель,Амалеа,Амали,Амалия,Амалья,Аманда,Амара,Амараллис,Амаранта,Амбер,Амброзин,Амей,Амели,Аметист,Ами,Амая,Амилия,Амис,Анабел,Анабела,Анабелла,Анабель,Анастася,Ангел,Анджела,Анджелика,Анджелиса,Анджелия,Анджелл,Анджеллина,Анджелль,Анди,Андии,Андра,Андреа,Андри,Андриана,Андрина,Андринна,Анета,Анетта,Анж,Анжела,Анжелина,Анис,Анита,Анитра,Анна,Аннабель,Аннали,Аннама,Аннамария,Аннамей,Аннджела,Аннейблл,Аннейбт,Аннема,Аннемари,Анникк,Аннис,Аннита,Аннитра,Аннмари,Аннтеа,Ансония,Анстас,Анстей,Анстис,Антия,Антонет,Антония,Арабела,Арабэль,Арден,Арейблл,Арета,Ариана,Арил,Арлайн,Арли,Арлин,Арлина,Арьяна,Арян,Аселайн,Асиа,Асселайн,Асселина,Астон,Астра,Аура,Африка,Африках,Африца,Африцах,Афтон,Аффрика,Аффриках,Аффрица,Аффрицах,Аффтон,Ашли,Ашлая,Ашлий,Ашлин,Ашлинг,Аштон,Бабет,Бабс,Баили,Байб,Байли,Бамби,Банни,Банти,Банш,Барб,Барбара,Барби,Барбра,Баффи,Беа,Беатрис,Беатриса,Беверли,Бевин,Бейли,Бека,Беках,Бекка,Бекки,Беккай,Белинд,Белинда,Белита,Беллатрикс,Беллинда,Бенедикта,Бердайн,Беренгари,Беренгария,Беренис,Берилл,Берлин,Бернадайн,Бернадетт,Бернайс,Бернардайн,Бернетта,Бернис,Берта,Берти,Бертина,Беси,Бесс,Бесси,Бет,Бетани,Бетней,Бетс,Бетси,Бетт,Беттай,Бетти,Беттина,Беттси,Бетэни,Беула,Беулах,Беччи,Би,Бидди,Бижу,Билли,Бинди,Бланда,Бланид,Бланч,Блис,Блонди,Блоссом,Блэр,Блэссинг,Блюбелл,Бобби,Боби,Бони,Бонита,Бонни,Брайди,Бранди,Брандая,Бреда,Бренда,Бренди,Бренна,Бретань,Брет,Бриана,Брианн,Брианна,Бриар,Бридгет,Бриджит,Браяр,Брий,Брилл,Брин,Брина,Бринн,Бринна,Бриония,Бритней,Бриттани,Бриттней,Бриттни,Броук,Брук,Бруклин,Брьяна,Брьянн,Брьянна,Брэди,Брэйди,Брэйнд,Бургунди,Бэб,Бэйлай,Бэйли,Бэлл,Бэль,Бэмби,Бэрри,Валентайн,Валери,Валори,Валэри,Ванесса,Ванна,Вега,Веда,Вел,Велари,Велда,Велма,Вена,Венда,Венди,Вендая,Венера,Венона,Венонна,Верина,Верити,Верна,Вероника,Веста,Ви,Вианн,Вивиан,Вивианн,Вивитт,Вивьян,Виики,Вик,Вики,Викки,Виктория,Вилла,Виллоу,Вилма,Вилфреда,Вина,Винифред,Винни,Винона,Винонна,Винтер,Виола,Виолет,Вирги,Вирджиния,Висдом,Витней,Вонда,Вонни,Врен,Габби,Габи,Габриэлла,Гае,Гаеа,Гай,Гардения,Гармония,Гарнет,Гарраят,Гасси,Гваделупа,Гвен,Гвенда,Гвендолайн,Гвендолин,Гвенет,Гвенит,Гвеннет,Гвеннит,Гейл,Гемма,Гена,Генезис,Генет,Гени,Гениста,Гения,Генна,Генни,Генраетта,Генья,Герти,Гертруда,Гиацинт,Гина,Гислэйн,Гита,Гия,Гленда,Гленис,Гленна,Глинис,Глодуса,Глори,Глориана,Глорианна,Глория,Глэдис,Глэнис,Годива,Голди,Граки,Грет,Грета,Гретта,Гретэль,Гречен,Грир,Грэйс,Гэй,Гэйа,Гэйл,Гэйла,Гэйнор,Давида,Давиния,Давн,Дайанн,Дайзи,Даймонд,Дайна,Дакей,Дакота,Далила,Далинда,Далия,Далки,Далья,Дамиана,Дамия,Дана,Данетт,Дани,Данил,Данилла,Данита,Дания,Данни,Данья,Дапн,Дарби,Дариан,Дарил,Дарин,Дария,Даркей,Дарки,Даркая,Дарла,Дарлайн,Дарлин,Даррил,Даффодил,Дахлия,Деб,Деббай,Дебби,Деббая,Деби,Дебора,Дебра,Дебс,Деван,Девен,Девнет,Девон,Деджа,Дездемона,Дезира,Дезире,Дезири,Деидр,Деидра,Деитра,Дей,Делайла,Делайт,Деланей,Делила,Делинда,Делис,Делисия,Делия,Делла,Делора,Делорис,Делоурс,Делфин,Делфия,Дель,Дельта,Деметрия,Деми,Дена,Дениз,Дениза,Денис,Дениса,Деррил,Деспина,Дестине,Дестини,Детта,Джадин,Джазмайн,Джазмин,Джакалайн,Джакалин,Джаки,Джакинда,Джакки,Джаклайн,Джаклин,Джакобина,Джами,Джана,Джанайн,Джаней,Джанелл,Джанет,Джани,Джанин,Джанис,Джанкис,Джанна,Джаннайн,Джаннет,Джанэль,Джасмин,Джасминн,Джасти,Джастина,Джджи,Джевел,Джезебэл,Джейд,Джейдн,Джейми,Джейн,Джейнка,Джейнл,Джейнлла,Джейнни,Джейнсса,Джейнта,Джейрри,Джекки,Джеклин,Джелисса,Джемима,Джемма,Джен,Джена,Дженел,Дженесса,Джени,Дженис,Дженифер,Дженн,Дженна,Дженни,Дженника,Дженнифер,Джера,Джери,Джерри,Джес,Джесмайн,Джесса,Джессай,Джессалин,Джессамин,Джессения,Джесси,Джессика,Джетта,Джилберта,Джили,Джилл,Джилли,Джиллиан,Джин,Джина,Джиневра,Джинет,Джинетта,Джинжер,Джини,Джинна,Джиннайн,Джинни,Джипси,Джита,Джо,Джоан,Джоандра,Джоанна,Джоаннэ,Джобет,Джодай,Джоджо,Джоди,Джодая,Джодин,Джоел,Джоетта,Джозелин,Джозефа,Джозефина,Джоисс,Джой,Джойс,Джокаста,Джолайн,Джоли,Джолин,Джона,Джонел,Джонет,Джони,Джонна,Джонни,Джордан,Джордана,Джорджа,Джорджиана,Джорджин,Джорджина,Джорджия,Джордин,Джоржет,Джоржи,Джоржинна,Джори,Джоселайн,Джоселин,Джосет,Джоси,Джос,Джосселайн,Джосселин,Джосслин,Джоуни,Джохэйнн,Джоэй,Джуди,Джудая,Джудит,Джули,Джулиана,Джулианн,Джулианна,Джулия,Джулс,Джульета,Джунифер,Джуно,Джустине,Джустис,Джюелл,Джэйд,Джэйда,Джэйден,Джэйдон,Джэйла,Джэйли,Джэйм,Джэйма,Джэйми,Джэйн,Джэйна,Джэйни,Джэклин,Джэн,Джэнни,Джэрри,Джэсси,Джэссика,Ди,Диаманда,Диан,Диана,Дианна,Дивина,Диди,Дикс,Диксай,Дикси,Димпна,Дина,Динн,Динна,Дийана,Длила,Доди,Доллей,Долли,Доллая,Доллии,Долорес,Домина,Доминик,Доминика,Дона,Донелл,Донна,Донолда,Донолдина,Дора,Дорайн,Дорета,Дори,Дорин,Доринда,Доринн,Дорис,Дорита,Дороте,Доротея,Дороти,Доррис,Дорта,Дорти,Дот,Доти,Дотая,Дреа,Дреда,Друсилла,Дуана,Дулс,Дулсия,Дьян,Дэйл,Дэйна,Дэйо,Ева,Ерания,Ербана,Ерлайн,Ерлин,Ерлине,Ернестайн,Ерселла,Ерта,Етта,Жаклин,Жанин,Жасмин,Ждун,Женева,Женевьева,Жонкилия,Жоселин,Жульен,Жюлаят,Жюль,Завана,Заванна,Завия,Зандра,Зара,Зелия,Зелла,Зелма,Зена,Зения,Зибилла,Зови,Зоей,Зои,Зэда,Зэлма,Зэодора,Зэодосия,Ив,Ива,Иван,Ивет,Иви,Ивон,Ивори,Игрэйн,Ида,Идел,Идет,Идета,Идони,Изабелла,Изабель,Изабэль,Иззи,Иззая,Изидора,Ииша,Илайн,Илана,Илин,Илинн,Имогин,Имоджен,Ина,Инди,Индиана,Индиго,Индия,Инноджен,Иоланда,Иолонда,Ирена,Ирис,Ирланд,Ирма,Ирэн,Ислин,Исси,Иша,Йена,Ка,Кади,Каелеа,Каели,Каети,Казандра,Казарин,Какей,Каки,Каланз,Калантия,Калей,Кали,Калида,Калин,Калла,Калта,Камелия,Камея,Камила,Камилла,Камми,Камрин,Кандас,Канди,Кандида,Кандис,Канедс,Каприна,Капукайн,Кара,Карамия,Карей,Карен,Кари,Каризма,Карил,Карин,Карина,Карис,Карисса,Карита,Карла,Карлей,Карли,Карлая,Карлин,Карлиса,Кармела,Кармен,Кармэль,Карнатион,Карог,Карол,Каролин,Каролина,Карон,Карри,Каррин,Касия,Касс,Кассандра,Касси,Кассиа,Кассиди,Кассия,Кат,Катей,Катерин,Кати,Катая,Катлин,Катрайона,Катрин,Катрина,Катэрин,Кевин,Кезиа,Кеила,Кеира,Кеита,Кеития,Кеиша,Кей,Кейднс,Кеймрон,Кейрна,Кейрнза,Кейси,Кейт,Кейтлайн,Кейтлин,Кейтл,Келия,Келкей,Келл,Келлай,Келлей,Келли,Келлая,Келсей,Келси,Келсая,Кенда,Кендол,Кендра,Кензи,Кения,Кенна,Кеннеди,Кера,Керенза,Керенса,Кери,Керра,Керрай,Керри,Керрая,Керстин,Кестрел,Кетрин,Кешия,Киана,Киара ,Киарра,Кибил,Кива,Киви,Кики,Кила,Килан,Килей,Килер,Кили,Килин,Килла,Ким,Кимберлай,Кимберлая,Кимберли,Кимберлин,Кимберлли,Кимбра,Кимми,Кингслей,Кинди,Киндра,Кира,Кирилла,Кирра,Кирстен,Кирсти,Кирстин,Кирстэн,Кисели,Кит,Кити,Китти,Киша,Клайд,Клара,Кларама,Кларамей,Кларет,Кларибэль,Кларинда,Кларити,Клаудия,Клематис,Клеменси,Клементайн,Клементина,Клео,Клер,Клла,Кловер,Клод,Клодайн,Клодет,Клоди,Клотильда,Клэр,Клэрис,Кнби,Коди,Коертней,Коко,Колайн,Колет,Колиин,Колла,Коллайн,Колли,Коллин,Колоер,Колумбина,Комфорт,Конни,Конрадайн,Констанция,Кора,Корайн,Корали,Коралл,Корделия,Кордула,Коретта,Кориандр,Корин,Корина,Коринна,Корнелия,Корона,Коррайн,Корри,Кортней,Крен,Крессида,Кризанта,Крис,Криси,Крисси,Криста,Кристабель,Кристабэль,Кристай,Кристайн,Кристал,Кристел,Кристен,Кристи,Кристиана,Кристая,Кристин,Кристина,Кристинэ,Кристия,Кристл,Кристобэль,Кристэль,Ксавира,Ксавия,Ксара,Ксена,Ксилина,Ксилия,Куанда,Куанна,Куиана,Куианна,Куилла,Куина,Куини,Куинн,Куинта,Кэй,Кэйки,Кэйла,Кэйлей,Кэйли,Кэйлин,Кэйлинн,Кэйлих,Кэйти,Кэйтлин,Кэйтлинн,Кэнди,Кэндис,Кэролайн,Кэролин,Кэрри,Кэти,Кэтлин,Лав,Лаванда,Лаверн,Лавина,Лавон,Лавоун,Ладжина,Ладонна,Лайза,Лакейша,Лакей,Лакешия,Лакиша,Лакретия,Лаладж,Лалия,Лана,Ланей,Лара,Лареина,Лари,Ларин,Лариса,Ларисса,Ларк,Ларэйн,Латиша,Латонья,Латоя,Лаура,Лаурел,Лаци,Лашей,Лашон,Лашонда,Леа,Леди,Леия,Лейвна,Лейврн,Лекса,Лексайн,Лексей,Лекси,Лексия,Лексус,Ленор,Ленора,Леола,Леон,Леона,Леонора,Леонтайн,Лес,Лесия,Леслей,Лесли,Леслая,Леслии,Лесси,Лета,Летития,Летти,Летха,Ли,Лиана,Лианн,Лианна,Либбей,Либби,Либерти,Ливви,Лида,Лидди,Лидия,Лиз,Лиза,Лизандра,Лизанн,Лизбет,Лиззи,Лиззая,Лии,Лилас,Лили,Лилиан,Лилиана,Лилит,Лилия,Лиллай,Лилли,Лиллиан,Лиллия,Лин,Лин,Линда,Линден,Линди,Линдсеа,Линдсей,Линдси,Линдсая,Линетт,Линзи,Линн,Линна,Линнаеа,Линне,Линнет,Линнетт,Линни,Линсей,Линси,Лира,Лирика,Лис,Лиса,Лисбет,Лисса,Лита,Литон,Литрис,Лих,Лоанда,Логан,Лоис,Лола,Лоли,Лолисия,Лолла,Лолли,Лондон,Лор,Лорайн,Лорей,Лорел,Лорен,Лорена,Лоренсия,Лоресса,Лорет,Лорето,Лоретта,Лори,Лорин,Лоринда,Лорис,Лорисса,Лорита,Лорна,Лоррей,Лорри,Лорэйн,Лорэн,Лотос,Лотт,Лотти,Лоуелла,Лу,Луана,Луанн,Луанна,Луанне,Лувиния,Луг,Луелла,Луиза,Луиса,Лукайл,Лукет,Лукил,Лукинда,Лурд,Лусетта,Льюелла,Лэйдей,Лэйла,Лэйней,Лэйтанья,Лэйташа,Лэйтон,Лэтти,Люкс,Люси,Мабелла,Мабель,Мавис,Маврина,Магдейлн,Магнолия,Мадалин,Мадди,Маддисон,Мадизин,Мадизон,Мадисон,Мадкэн,Мадлин,Мадолайн,Мадонна,Мае,Маеган,Макей,Маки,Маккензи,Маккенна,Маккэйла,Максайн,Максин,Макэйла,Маландра,Малина,Малинда,Малих,Мами,Манди,Маралин,Маргарет,Маргарита,Марго,Маргот,Маргоу,Мардж,Марджери,Марджи,Марджори,Мари,Мариа,Мариабелла,Мариам,Мариамн,Марианна,Марибет,Маривонн,Маригольд,Марил,Марилена,Марилин,Марил,Марилоу,Марилу,Марина,Маринда,Марис,Мариса,Марисса,Мария,Мариянн,Маркей,Марки,Маркая,Марла,Марлей,Марлена,Марли,Марлая,Марлин,Марселин,Марта,Мартса,Марша,Марьянн,Матильда,Матти,Матхильда,Махала,Махалия,Меган,Мед,Мейбл,Мейдлин,Мейдлэйн,Мейкнзи,Мейкнна,Мелайора,Мелани,Мелба,Мелва,Мелинда,Мелиса,Мелисент,Мелисса,Мелия,Мелл,Меллони,Мелодия,Мередит,Мериветэр,Меридет,Мерил,Мерилин,Мерл,Мерла,Мерлин,Меррилин,Меррил,Меррит,Мерседес,Мерсия,Мерфи,Миа,Миган,Мигнон,Мигнонет,Мид,Мидж,Микки,Милдред,Милизент,Милисент,Миллезант,Милли,Миллисент,Милосердая,Мими,Минди,Минни,Мира,Мирабель,Мирайн,Миракл,Миранда,Мириам,Мирна,Миррайн,Мирт,Мирти,Миси,Мисси,Мисти,Мичаела,Мичелайн,Мичел,Мичэйла,Мо,Мод,Модести,Моди,Моира,Мойна,Мойра,Моли,Молли,Мона,Монат,Моника,Мониса,Монна,Монта,Монтана,Мора,Морайн,Морвен,Морган,Моргана,Морген,Мориа,Морин,Моринн,Моулд,Мья,Мэб,Мэг,Мэгги,Мэдж,Мэй,Мэйбеллайн,Мэйбель,Мэйбл,Мэйм,Мэйрдж,Мэйрджори,Мэйси,Мэлори,Мэль,Мэнди,Мэри,Мэриан,Мэрилин,Мэрион,Мэрит,Мюриэл,Награда,Надайн,Надия,Нанни,Нанная,Наоми,Натали,Натил,Натиша,Нева,Невада,Неваех,Нел,Нелда,Нел,Нелла,Нелли,Неллая,Нерайн,Нерисса,Несса,Несси,Нетта,Ниджелия,Ниджелла,Нидия,Никеиша,Никки,Никкоул,Никол,Никола,Николет,Никоул,Нина,Нирвана,Нири,Нита,Ноа,Нова,Ноелин,Ноел,Нола,Нолвен,Нолин,Нона,Нони,Нора,Норей,Норин,Норине,Норма,Ноуа,Нубия,Нэйтали,Нэн,Нэнси,Оанез,Обрей,Обри,Оди,Одра,Одреа,Одри,Океан,Октавия,Олив,Оливет,Оливая,Олин,Оллана,Олли,Оллизон,Оллин,Оллисия,Омега,Ондре,Ондреа,Ондриа,Ондрия,Онеида,Онндреа,Онндрия,Опал,Опалин,Опра,Ора,Орабэль,Орали,Ореол,Ориана,Орла,Орлаг,Орленда,Орна,Орнат,Орхид,Осанна,Осина,Остин,Отом,Оубри,Оуэна,Паджет,Памела,Памила,Панси,Париж,Паркер,Паррис,Патаянс,Патрисия,Патси,Патти,Паттая,Паула,Пегги,Пейтон,Пейдж,Пеймлия,Пеймлла,Пейсли,Пенелопа,Пенелоуп,Пенни,Перл,Перла,Перли,Перонел,Перонэль,Персефон,Пета,Петронелла,Петронэль,Петти,Петула,Петуния,Паяти,Пин,Пион,Пипер,Пиппа,Пис,Питронелла,Плесант,Плисанс,Полет,Полетта,Поли,Полин,Полина,Полли,Поллиана,Поллин,Поппи,Портия,Порш,Посей,Поси,Прайз,Примроуз,Примула,Принцесс,Прис,Присси,Присцилла,Пру,Пруденс,Прунелла,Прю,Пуси,Пэг,Пэгги,Пэйдж,Пэйтон,Пэм,Пэн,Пэт,Равен,Равенна,Радклиф,Раелин,Раккуэль,Ралфина,Ранда,Ранди,Рандая,Рауэна,Рачаэль,Рачел,Рачил,Рачиль,Рашел,Реба,Ребека,Ребекка,Ребеккэйнн,Реваа,Реган,Регана,Реджина,Рей,Рейли,Рейн,Рексана,Рексэйн,Рена,Рени,Ренита,Рета,Риа,Риган,Рика,Рикена,Рики,Рикки,Рикэндра,Рили,Рилли,Рин,Рина,Ринна,Рио,Риплей,Рита,Ричардайн,Ричелл,Ричи,Робби,Робен,Роберта,Робертина,Роби,Робин,Робина,Рован,Роелин,Роз,Роза,Розабэль,Розалин,Розалина,Розалинда,Розамонд,Розамунда,Розан,Розаулин,Розашарн,Розелин,Розенн,Рози,Розинн,Розмари,Розэйн,Раяс,Роксан,Роксана,Роксанна,Рокси,Роксая,Роксэйн,Ромей,Роми,Ромэйн,Рона,Ронда,Рони,Ронит,Роннет,Ронни,Ронолда,Роси,Росинн,Росита,Рослин,Роуз,Роуина,Роуон,Рочел,Рошин,Рубай,Руби,Рубин,Рубина,Рут,Рути,Рхеия,Рхетта,Рхианна,Рхинна,Рхода,Рхона,Рхонда,Рьяна,Рьянн,Рэбека,Рэбекка,Рэйлин,Рэймонд,Рэйн,Рэйчел,Сабелла,Сабина,Сабл,Сабрин,Сабрина,Савана,Саванна,Сади,Сайв,Сал,Салина,Салли,Салоум,Саманта,Сами,Саммер,Самми,Саммая,Санди,Санни,Саншайн,Сапфир,Сара,Саранна,Сарахджин,Сарей,Сариа,Сарина,Сарра,Саффрон,Седар,Сейдж,Сейлна,Секуойя,Селби,Селена,Селеста,Селина,Селма,Сеона,Септембер,Септима,Серена,Серенити,Серина,Серрена,Сесилия,Сесси,Сибил,Сибила,Сибилл,Сибилла,Сидн,Сидней,Сидни,Саял,Саяна,Саянна,Силбер,Силвана,Силви,Силестайн,Сили,Силинда,Силия,Сильвия,Симфония,Синдерелла,Синди,Синна,Синтия,Сиселия,Сисси,Ситлин,Скай,Скарлет,Скарлетт,Скей,Скилар,Скилер,Скоут,Скуилер,Слоан,Солли,Сондра,Соррель,Софи,София,Соффи,Спарроу,Спирит,Спринг,Стакей,Стаки,Стакки,Стар,Старла,Стасия,Стелла,Стеф,Стефани,Стефания,Стиви,Сторм,Стэки,Стэффи,Суеллен,Сузан,Сузанна,Сузи,Суки,Сьерра,Сью,Сьюзен,Сьюзи,Сэм,Сюзан,Сюзанна,Сюзет,Табата,Табби,Табита,Таджуана,Талалла,Талита,Талиша,Тамзен,Тами,Тамика,Тамия,Таммара,Тамми,Таммая,Тамра,Тамсен,Тамсин,Тамсон,Танзи,Тани,Тания,Танси,Тара,Тарина,Тасия,Татум,Татьянна,Тауни,Твила,Твилла,Теа,Тейлтта,Теймка,Теймла,Теймра,Тейнзи,Тейра,Текла,Темперансе,Темпест,Темпл,Тера,Тереза,Тери,Терра,Террай,Террая,Тесса,Тесси,Тетти,Тиана,Тианна,Тиара,Тибби,Тиил,Тил,Тилда,Тилер,Тили,Тилли,Тимаса,Тимотеа,Тина,Тирра,Титания,Титти,Тифани,Тиффани,Тиша,Тия,Томазин,Томазина,Тони,Тоннер,Тонни,Тонья,Топаз,Топпси,Топсей,Топси,Тория,Торусы,Тоти,Тотти,Тойя,Тракей,Траки,Тракки,Траффорд,Трейс,Трейси,Треси,Треша,Трикс,Трикси,Трина,Тринити,Трисия,Триш,Триша,Тришуэ,Трия,Трудей,Труди,Трудая,Тэйлер,Тэйлор,Тэйт,Тэра,Тэрри,Тэсс,Уна,Унаг,Уонда,Урсула,Фавн,Фае,Фаит,Файона,Файонола,Фанесса,Фани,Фанни,Фанси,Фара,Фарлей,Фарра,Феб,Фей,Фелина,Фелисити,Фелисия,Феличе,Фелиша,Фенелла,Феоб,Ферн,Филипа,Филиппа,Филиппин,Филиппина,Филис,Филлида,Филлис,Филлисе,Филомэль,Фими,Финелла,Финикс,Финола,Фирн,Флауэр,Флееретта,Флер,Флик,Флика,Фло,Флоелла,Флор,Флора,Флорайн,Флоренция,Флорет,Флоретта,Флори,Флоринда,Флорри,Флосси,Фоеб,Фона,Фортуна,Фран,Франкайн,Франкин,Франни,Франциска,Фреда,Фредди,Фредерика,Фрида,Фрэнки,Фэй,Фэйзэ,Фэрн,Хадлей,Хайди,Хайме,Халей,Хали,Хана,Хани,Ханна,Ханни,Хантер,Хара,Харлей,Хармони,Харпер,Харрит,Харритта,Хартлей,Хатти,Хезер,Хейз,Хейзел,Хейли,Хелене,Хелин,Хеллен,Хенритте,Хестер,Хетти,Хиацинт,Хилари,Хилда,Хиллэри,Хильда,Хло,Хлоя,Хозанна,Холли,Холлис,Хонор,Хонора,Хоратия,Хортенс,Хортенсия,Хоунор,Хоуп,Хэвен,Хэйден,Хэйди,Хэйлей,Хэйли,Хэппи,Хэтти,Циан,Цинния,Чазити,Чайна,Чана,Чанелл,Чантэйл,Чантэль,Чанэль,Чарис,Чарисса,Чарита,Чарити,Чарла,Чарлайн,Чарли,Чарлая,Чарлин,Чарлине,Чармиан,Чармэйн,Частити,Чевонн,Челис,Челл,Челсей,Челси,Челсая,Ченс,Чер,Черет,Чери,Черая,Чериз,Черил,Черилин,Черис,Чериш,Черокез,Черри,Чеьянн,Чина,Чонси,Чэйнт,Ша,Шавон,Шаелин,Шайен,Шакуила,Шан,Шана,Шанел,Шаника,Шаникуа,Шанин,Шанис,Шания,Шанна,Шаннен,Шаннон,Шанта,Шантел,Шантэль,Шаралин,Шари,Шариз,Шарил,Шарин,Шарла,Шарлин,Шарлотта,Шармейн,Шарона,Шаррон,Шеба,Шевон,Шевоун,Шей,Шейла,Шелаг,Шелби,Шелена,Шелия,Шелл,Шеллей,Шена,Шеона,Шери,Шерая,Шерил,Шерилин,Шерис,Шерлей,Шерли,Шерри,Ши,Шила,Шилаг,Шина,Шинаг,Ширли,Шона,Шонда,Шони,Шэй,Шэйла,Шэйлин,Шэйн,Шэрон,Эбби,Эббая,Эбони,Эвалин,Эвелайн,Эвелайна,Эвелин,Эвелина,Эвелия,Эверет,Эвет,Эви,Эвон,Эгги,Эглантина,Эдвайна,Эдвена,Эдвина,Эдди,Эди,Эдизэ,Эдилтрудис,Эдина,Эдит,Эдита,Эдна,Эдэн,Эзэлдреда,Эзэлинда,Эзэлфледа,Эйвери,Эйвис,Эйвисе,Эйлин,Эймей,Эйми,Эйн,Эйприл,Элайн,Элайора,Эланор,Элдреда,Элеа,Элеанор,Элен,Элена,Эленора,Элеонор,Элеоноре,Элиз,Элиза,Элизабет,Элизейбт,Элин,Элинор,Элинора,Элиса,Элисия,Элисон,Элисса,Элиша,Элишия,Элл,Элла,Эллен,Элленор,Эллери,Элли,Эллисон,Элмира,Элоиза,Элоуиз,Элсбет,Элсейбт,Элси,Элспет,Элспи,Элфреда,Элфрида,Эль,Эльба,Эльза,Эльфрида,Эм,Эмели,Эмелия,Эмеральд,Эми,Эмилайн,Эмили,Эмилин,Эмилия,Эмити,Эмлин,Эмма,Эммалайн,Эммелин,Эммет,Эмми,Эммая,Эна,Энджи,Энди,Энима,Энн,Энни,Энн-Мэри,Энола,Энья,Эпифани,Эпона,Эппи,Эрика,Эрикка,Эрин,Эриса,Эрма,Эрнеста,Эрнестайн,Эсмерелда,Эсмеролда,Эсса,Эссенсе,Эсси,Эста,Эстель,Эстер,Эстэ,Этна,Этта,Этти,Этхна,Этэль,Эффи,Эффая,Эхо,Эш,Эшли,Юджиния,Юла,Юлалия,Юлия,Юнис,Юнити,Юстасия,Язмин,Яник,Янник,Ясмайн,Ясмина,Яшмайн";

//Глобальные переменные
var i;
var j;
var html = document.createElement('html');
var post;
var get;
var horsesId = [];
var salesList = [];
var listToSaleRewrite = [];
var affixesList = [];
var farmsList = [];
var fNames = femaleNames.split(',');
var mNames = maleNames.split(',');
//Загрузка настроек
var inputs = ['sellrewBuyPrice', 'sellrewFarm', 'sellrewAffixe', 'sellrewMale', 'sellrewFemale', 'sellrewAuctionEquus', 'sellrewDirectEquus', 'sellrewDirectPasses', 'sellrewReserveEquus', 'sellrewReservePasses', 'sellrewBreeder', 'sellrewSelectAmount', 'sellrewHorseNumber'];
var selects = ['sellrewAddToName'];
var checkboxes = ['sellrewBuy', 'sellrewRewrite', 'sellrewRandom', 'sellrewSell', 'sellrewTeam', 'sellrewBuyEquus', 'sellrewBuyPasses', 'sellrewAuction', 'sellrewDirect', 'sellrewReserved'];
var arr = [];
arr = arr.concat(inputs).concat(selects).concat(checkboxes);
var set = {};
for (i = 0; i < arr.length; i++) {
	set[arr[i]] = localStorage.getItem(arr[i]);
}
var sellrewStartup = localStorage.getItem('sellrewStartup');
if ((sellrewStartup == null) || (sellrewStartup == undefined)) {sellrewStartup = 0;}
if (set.sellrewBuyEquus == '1') {$('#sellrewBuyPrice').attr('min', '500').change(); $('#sellrewBuyPrice').attr('max', '1500000').change();}
else if (set.sellrewBuyPasses == '1') {$('#sellrewBuyPrice').attr('min', '10').change(); $('#sellrewBuyPrice').attr('max', '2500').change();}
function parse(result) {
	html.innerHTML = result;
}

function randomInteger(min, max) {
	var rand = min + Math.random() * (max + 1 - min);
	rand = Math.floor(rand);
	return rand;
}

function fillSalesList(i) {
	var horseGp = 0;
	var cTable = document.createElement('html')
	cTable.innerHTML = $('#table-0 tr.highlight:eq('+ i +') span.competence', html).attr('data-tooltip');
	for (j = 0; j < $('strong', cTable).length; j++) {horseGp += (Number($('strong', cTable).eq(j).text().replace(/ /gim, '').replace(/,/gim, '.')));}
	horseGp = horseGp.toFixed(2);

	var horseSkills = 0;
	var cTable = document.createElement('html')
	cTable.innerHTML = $('#table-0 tr.highlight:eq('+ i +') div.competence', html).attr('data-tooltip');
	for (j = 0; j < $('strong', cTable).length; j++) {horseSkills += (Number($('strong', cTable).eq(j).text().replace(/ /gim, '').replace(/,/gim, '.')));}
	horseSkills = horseSkills.toFixed(2);

	horsesId[horsesId.length] = $('#table-0 tr.highlight:eq('+ i +') a.horsename', html).attr('href').split('=')[1] + 'SELLREW' + $('#table-0 tr.highlight:eq('+ i +') a.horsename', html).text() + 'SELLREW' + $('#table-0 tr.highlight:eq('+ i +') img:eq(1)', html).attr('src').split('/')[6] + 'SELLREW' + horseGp + 'SELLREW' + horseSkills + 'SELLREW' + $('#table-0 tr.highlight:eq('+ i +') img.cheval-icone', html).attr('alt');
	var firstPrix = Number($('#table-0 tr.highlight:eq('+ i +') td div[id*="prix"]', html).text().replace(/[ ,NEGOTIABLE]/gim, ''));
	var scr = $('#table-0 tr.highlight:eq('+ i +') td div[id*="acheter"] script', html).html();
	var i1 = scr.indexOf('params') + 10;
	var i2 = scr.indexOf(' return false') - 7;
	scr = scr.substring(i1, i2).toLowerCase();
	salesList[salesList.length] = scr;
}

function getSales(m) {
	salesList = [];
	if (localStorage.getItem('race-ane') == null) {
		get = $.ajax({
			type: "GET",
			url: window.location.origin + "/marche/vente/?type=prive&typeSave=1&"
		})
		.then(function(result) {
			parse(result);
			localStorage.setItem('race-ane', $('#race-ane', html).val());
			getSales();
		});
	}
	else {
		var compar = 'l';
		if (set.sellrewBuyPrice == '') {compar = 'g';}
		if (set.sellrewBuyEquus == '1') {
			get = $.ajax({
				type: "GET",
				url: window.location.origin + "/marche/vente/?type=prive&typeSave=1&amountComparaison=" + compar + "&amount=" + (Number(set.sellrewBuyPrice) + 1) + "&currency=soft&race-ane=" + localStorage.getItem('race-ane') + "&pierre-philosophale=2&sablier-chronos=2&bras-morphee=2&lyre-apollon=2&pack-nyx=2&caresse-philotes=2&don-hestia=2&chapeau-magique=2&double-face=2&livre-monstres=2&catrina-brooch=2&esprit-nomade=2&cloches=2&cravache=2&eperons=2&longe=2&crampons=2&tri=expirationDate&sens=DESC"
			})
			.then(function(result) {
				parse(result);
				if ($('img[src*="chevaux"]', html).length > 1) {
					for (i = 0; i < $('#table-0 tr.highlight', html).length; i++) {
						fillSalesList(i);
					}
					//buyHorse();
					console.log(horsesId);
					getTeamAffixes();
				}
				else {
					if ((set.sellrewRewrite == '2') && (set.sellrewSell == '2')) {
						if (horsesId.length == 0) {
							alert('Ваши зарезервированные продажи по данным настройкам пусты. Ваши настройки:\nВалюта: экю\nМакс. цена: ' + set.sellrewBuyPrice);
						}
						localStorage.setItem('sellrewStartup', 0);
						localStorage.removeItem('sellrewWorkPlace');
						location.reload();
					}
					else {
						console.log('Готово!');
					}
				}
			});
		}
		else if (set.sellrewBuyPasses == '1') {
			get = $.ajax({
				type: "GET",
				url: window.location.origin + "/marche/vente/?type=prive&typeSave=1&amountComparaison=" + compar + "&amount=" + (Number(set.sellrewBuyPrice) + 1) + "&currency=hard&race-ane=" + localStorage.getItem('race-ane') + "&pierre-philosophale=2&sablier-chronos=2&bras-morphee=2&lyre-apollon=2&pack-nyx=2&caresse-philotes=2&don-hestia=2&chapeau-magique=2&double-face=2&livre-monstres=2&catrina-brooch=2&esprit-nomade=2&cloches=2&cravache=2&eperons=2&longe=2&crampons=2&tri=expirationDate&sens=DESC"
			})
			.then(function(result) {
				parse(result);
				if ($('img[src*="chevaux"]', html).length > 1) {
					for (i = 0; i < $('#table-0 tr.highlight', html).length; i++) {
						fillSalesList(i);
					}
					//buyHorse();
				}
				else {
					if ((set.sellrewRewrite == '2') && (set.sellrewSell == '2')) {
						if (horsesId.length == 0) {
							alert('Ваши зарезервированные продажи по данным настройкам пусты. Ваши настройки:\nВалюта: пропуск\nМакс. цена: ' + set.sellrewBuyPrice);
						}
						localStorage.setItem('sellrewStartup', 0);
						localStorage.removeItem('sellrewWorkPlace');
						location.reload();
					}
					else {
						console.log('Готово!');
					}
				}
			});
		}
		else {
			alert('Вы не выбрали тип валюты для скупки лошадей! Проверьте настройки скрипта.');
		}
	}
}

var buyCounter = 0;
function buyHorse() {
	post = $.ajax({
		type: "POST",
		url : window.location.origin + '/marche/vente/prive/doAcheter',
		data: salesList[buyCounter]
	})
	.then(function(result) {
		buyCounter++;
		if (salesList[buyCounter] == undefined) {getSales(); buyCounter = 0;}
		else {buyHorse();}
	});
}

var teamAffixesCount = 0;
var teamAffixes = [];
function getTeamAffixes(m) {
	if ($('a.level-2.grid-table.width-100.align-middle[href^="/equipe/"]').length !== 0) {
		get = $.ajax({
			type: "GET",
			url: window.location.origin + '/equipe/'
		}).
		then(function(result) {
			parse(result);
			var teams = $('a[href*="/equipe/membre/?id="]', html);
			if ($(teams).eq(teamAffixesCount).length == 0) {
				getAffixes(m);
			}
			else {
				get = $.ajax({
					type: "GET",
					url: $(teams).eq(teamAffixesCount).attr('href'),
				}).
				then(function(result) {
					parse(result);
					teamAffixes[teamAffixes.length] = $('a.affixe', html).eq(0).text().replace(/ /gim, '').toLowerCase() + 'SELLREW' + $('a.affixe', html).eq(0).attr('href').split('id=')[1];
					teamAffixesCount++;
					if (teamAffixes.length < teams.length) {getTeamAffixes();}
					else {
						getAffixes(m);
					}
				});
			}
		});
	}
	else {
		getAffixes(m);
	}
}

function getAffixes(m) {
	affixesList = [];
	if (localStorage.getItem('affixesList') == null) {
		get = $.ajax({
			type: "GET",
			url: window.location.origin + '/elevage/bureau/?type=affixe'
		})
		.then(function(result) {
			parse(result);
			var affs = $('tr[height^="40"] .affixe', html);
			for (i = 0; i < affs.length; i++) {
				affixesList[affixesList.length] = $('tr[height^="40"] .affixe', html).eq(i).text().replace(/ /gim, '').toLowerCase() + 'SELLREW' + $('tr[height^="40"] .affixe', html).eq(i).attr('href').split('id=')[1];
			}
			if (teamAffixes.length > 0) {affixesList = affixesList.concat(teamAffixes);}
			localStorage.setItem('affixesList', affixesList);
			getFarms(m);
		});
	}
}

function getFarms(m) {
	farmsList = [];
	if (localStorage.getItem('farmsList') == null) {
		get = $.ajax({
			type: "GET",
			url: window.location.origin + '/elevage/chevaux/?elevage=all-horses'
		})
		.then(function(result) {
			parse(result);
			var farms = $('.tab-action-select', html);
			for (i = 0; i < farms.length; i++) {
				farmsList[farmsList.length] = $('.tab-action-select', html).eq(i).text().replace(/ /gim, '').toLowerCase() + 'SELLREW' + $('.tab-action-select', html).eq(i).attr('href').split('tab-')[1];
			}
			localStorage.setItem('farmsList', farmsList);
			formRewriteData(horsesId[1]);
		});
	}
}

var coatRarity = 0;
var rewriteData = '';

function getCoatRarity(horse) {
	var hor = horse.split('SELLREW')[5];
	post = $.ajax({
		type: "POST",
		url: window.location.origin + '/communaute/doTabContent',
		data: 'type=tab-chevaux'
	})
	.then(function(result) {
		parse(result['statisticComplement']);
		var a = $('#table-2 a', html);
		var b = '';
		for (i = 0; i < a.length; i++) {
			if (hor.indexOf($(a).eq(i).text()) !== -1) {
				b = $(a).eq(i).attr('href'); break;
			}
		}
		get = $.ajax({
			type: "GET",
			url: window.location.origin + '/' + b,
		})
		.then(function(result) {
			parse(result);
			var percent = 100;
			var coats = $('#table-0 strong:not(".nowrap")', html);
			for (i = 0; i < coats.length; i++) {
				if (hor.indexOf($(coats).eq(i).text()) !== -1) {
					percent = Number($('#table-0 strong.nowrap', html).eq(i).text().replace('%', '')); break;
				}
			}
			if (percent < 6) {coatRarity = ' ' + percent + '%';}
			else {coatRarity = '';}
			formRewriteData(horse);
		});
	});
}

function formRewriteData(horse) {
	if ((set.sellrewAddToName == '3') && (coatRarity === 0)) {
		getCoatRarity(horse);
	}
	else {
		var a1; var a2; var a3; var a4; var isHorseFem;
		a1 = horse.split('SELLREW')[0];
		if (horse.split('SELLREW')[2].indexOf('fem') == -1) {isHorseFem = false} else {isHorseFem = true;}
		if ((isHorseFem) && (set.sellrewFemale == '')) {
			if (set.sellrewRandom !== '1') {a2 = horse.split('SELLREW')[1];}
			else {a2 = fNames[randomInteger(0, fNames.length)];}
		}
		else if ((isHorseFem == false) && (set.sellrewMale == '')) {
			if (set.sellrewRandom !== '1') {a2 = horse.split('SELLREW')[1];}
			else {a2 = mNames[randomInteger(0, mNames.length)];}
		}
		else if ((isHorseFem) && (set.sellrewFemale !== '')) {
			if (set.sellrewRandom !== '1') {a2 = set.sellrewFemale;}
			else {a2 = fNames[randomInteger(0, fNames.length)];}
		}
		else if ((isHorseFem == false) && (set.sellrewMale !== '')) {
			if (set.sellrewRandom !== '1') {a2 = set.sellrewMale;}
			else {a2 = mNames[randomInteger(0, mNames.length)];}
		}
		switch(set.sellrewAddToName) {
			case 'none': break;
			case '0': a2 = a2 + ' ' + horse.split('SELLREW')[3]; break;
			case '1': a2 = a2 + ' ' + horse.split('SELLREW')[3].slice(-5); break;
			case '2': a2 = a2 + ' ' + horse.split('SELLREW')[4]; break;
			case '3': a2 = a2 + coatRarity; break;
		}
		if (set.sellrewAffixe !== '') {
			if (set.sellrewAffixe == 'Без аффикса') {
				a3 = '';
			}
			else {
				for (i = 0; i < affixesList.length; i++) {
					if (set.sellrewAffixe.replace(/ /gim, '').toLowerCase() == affixesList[i].split('SELLREW')[0]) {a3 = affixesList[i].split('SELLREW')[1]; break;}
				}
			}
		}
		else {a3 = 'none';}
		if (set.sellrewFarm !== '') {
			if (set.sellrewFarm == 'Без завода') {
				a4 = '';
			}
			else {
				for (i = 0; i < farmsList.length; i++) {
					if (set.sellrewFarm.replace(/ /gim, '').toLowerCase() == farmsList[i].split('SELLREW')[0]) {a4 = farmsList[i].split('SELLREW')[1]; break;}
				}
			}
		}
		else {a4 = '';}

		if (a3 == 'none') {rewriteData = 'id=' + a1 + '&name=' + a2 + '&elevage=' + a4;}
		else {rewriteData = 'id=' + a1 + '&name=' + a2 + '&affixe=' + a3 + '&elevage=' + a4;}
		console.log(rewriteData);
	}
}

function rewriteHorse(m) {
	if (m == '1.2') {

	}
}

var mode;
var subMode;
function main() {
	refreshStatus();
	/*if (mode == 0) {
		alert('Вы не настроили режим работы скрипта, проверьте настройки!');
	}
	else if (mode == 1) {
		switch(subMode) {
			case 1: getSales('1.1'); break;
			case 2: getAffixes('1.2'); break;
			case 3: getSales('1.3'); break;
			case 4: getAffixes('1.4'); break;
		}
	}
	else if (mode == 2) {
		switch(subMode) {
			case 1: getSales('2.1'); break;
			case 2: getAffixes('2.2'); break;
			case 3: getSales('2.3'); break;
		}
	}*/
	getSales();
}

$(document).ready(function() {
	try {
		if (sellrewStartup == 1) {
			main();
		}
	}
	catch (e) {alert('Ошибка! Обратитесь к разработчику со скриншотом этого окна. Текст ошибки:\n' + e);}
});

function refreshStatus() {
		//Отображение режима
		$('#sellrewPanelSettings').css('height', '455px');
		if (localStorage.getItem('sellrewBuy') == '1') {
			$('#sellrewPanelSettings').css('height', '455px');
			switch(true) {
				case ((localStorage.getItem('sellrewRewrite') == '1') && (localStorage.getItem('sellrewSell') == '1')):
					$('#sellrewModeStatus p:eq(0)').text('Текущий режим: Выкуп -> переименовка -> продажа купленных');
					$('#sellrewPanelSettings').css('height', '470px'); subMode = 4;
				break;
				case ((localStorage.getItem('sellrewRewrite') == '1') && (localStorage.getItem('sellrewSell') !== '1')):
					$('#sellrewModeStatus p:eq(0)').text('Текущий режим: Выкуп -> переименовка купленных'); subMode = 2;
				break;
				case ((localStorage.getItem('sellrewRewrite') !== '1') && (localStorage.getItem('sellrewSell') == '1')):
					$('#sellrewModeStatus p:eq(0)').text('Текущий режим: Выкуп -> продажа купленных'); subMode = 3;
				break;
				default: $('#sellrewModeStatus p:eq(0)').text('Текущий режим: Только выкуп'); subMode = 1;
			}
			$('#sellrewModeStatus p:eq(1)').text('Место запуска: Офис или страница ЗП');
			mode = 1;
		}
		else if ((localStorage.getItem('sellrewBuy') !== '1') && ((localStorage.getItem('sellrewRewrite') == '1') || (localStorage.getItem('sellrewSell') == '1'))) {
			$('#sellrewPanelSettings').css('height', '455px');
			switch(true) {
				case ((localStorage.getItem('sellrewRewrite') == '1') && (localStorage.getItem('sellrewSell') == '1')):
					$('#sellrewModeStatus p:eq(0)').text('Текущий режим: Переименовка -> продажа'); subMode = 3;
				break;
				case ((localStorage.getItem('sellrewRewrite') == '1') && (localStorage.getItem('sellrewSell') !== '1')):
					$('#sellrewModeStatus p:eq(0)').text('Текущий режим: Только переименовка'); subMode = 1;
				break;
				case ((localStorage.getItem('sellrewRewrite') !== '1') && (localStorage.getItem('sellrewSell') == '1')):
					$('#sellrewModeStatus p:eq(0)').text('Текущий режим: Только продажа'); subMode = 2;
				break;
			}
			$('#sellrewModeStatus p:eq(1)').text('Место запуска: Завод с лошадьми');
			mode = 2;
		}
		else {
			$('#sellrewModeStatus p:eq(0)').text('Текущий режим: Не установлен');
			$('#sellrewModeStatus p:eq(1)').text('Место запуска: Не определено');
			mode = 0;
		}
	}
function refreshAm() { //Отображение кол-ва лошадей в списке на продажу/переименовку
	if (mode == 2) {
		$('#sellrewPanelSettings').css('height', '490px');
		$('#sellrewModeStatus p:eq(2)').css('display', '');
		$('#clearListToSaleRewrite').css('display', '');
		if (localStorage.getItem('listToSaleRewrite') !== null) {
			$('#sellrewModeStatus p:eq(2)').text('Лошадей в списке: ' + localStorage.getItem('listToSaleRewrite').split(',').length);
		}
		else {
			$('#sellrewModeStatus p:eq(2)').text('Лошадей в списке: 0');
		}
	}
	else {
		$('#sellrewModeStatus p:eq(2)').css('display', 'none');
		$('#clearListToSaleRewrite').css('display', 'none');
		refreshStatus();
	}
}

try {
	/*Главное окошко*/$('html[dir*="r"]').append('<div class="leftSidedPanel" id="sellrewPanel" style="background-color:rgba(60, 60, 60, 0.95); position:fixed; top:20px; left:0px; width:110px; height:103px; display:block; z-index:1000; border-radius:0px 10px 10px 0px; font-family:sans-serif"></div>');
	/*Окно настроек*/$('html[dir*="r"]').append('<div class="leftSidedPanel toggleable" id="sellrewPanelSettings" style="background-color:rgba(60, 60, 60, 0.95); position:fixed; top:20px; left:'+ ($('#sellrewPanel').width() + 10) +'px; width:430px; height:455px; display:none; z-index:1000; border-radius:10px; font-family:sans-serif"></div>');
	//Оформление главного окошка
	$('#sellrewPanel').append('<div class="tip" data-tippy-content="Посетить нашу группу" style="font-size:14px; margin-top:10px; margin-left:auto; margin-right:auto; text-align:center; widtn:150px; height:15px; font-weight:bold"><a target="_blank" href="https://vk.com/botqually" style="color:#ffffff">● Bot Qually ●</a></div>');
	$('#sellrewPanel').append('<div style="font-size:9px; margin-top:3px; margin-left:auto; margin-right:auto; text-align:center; font-weight:bold; color:#ffffff">version: seller-rewriter</div>');
	$('#sellrewPanel').append('<div id="sellrewButtons" style="margin-top:10px; margin-left:auto; margin-right:auto; text-align:center"></div>');
	$('#sellrewPanel').append('<div id="sellrewButtons1" style="position:absolute; top:90px; left:20px; display:none;"></div>');
	if ($('html[dir*="r"]').attr('dir') == "ltr") {
		$('#sellrewButtons').append('<span id="sellrewPower" style="cursor:pointer;"><img data-tippy-content="Вкл/выкл" class="hoverImage tip" src="https://cdn2.iconfinder.com/data/icons/circle-icons-1/64/power-512.png" style="width:30px;"></span>');
		$('#sellrewButtons').append('<span id="sellrewSettings" style="cursor:pointer; margin-left:10px; filter:hue-rotate(100deg);"><img data-tippy-content="Настройки" class="hoverImage tip" src="https://cdn2.iconfinder.com/data/icons/circle-icons-1/64/gear-256.png" style="width:30px;"></span>');
		$('#sellrewButtons1').append('<span id="sellrewSelectAll" style="cursor:pointer; filter:hue-rotate(100deg)"><img data-tippy-content="Выделить всех" class="hoverImage tip" src="https://cdn2.iconfinder.com/data/icons/circle-icons-1/64/check-128.png" style="width:30px;"></span>');
		$('#sellrewButtons1').append('<span id="sellrewAddList" style="cursor:pointer; margin-left:10px; filter:hue-rotate(247deg) brightness(1.7) saturate(60%);"><img data-tippy-content="Добавить в список" class="hoverImage tip" src="https://cdn4.iconfinder.com/data/icons/keynote-and-powerpoint-icons/256/Plus-128.png" style="width:30px;"></span>');
	}
	else {
		$('#sellrewButtons').append('<span id="sellrewPower" style="margin-left:10px; cursor:pointer;"><img data-tippy-content="Вкл/выкл" class="hoverImage tip" src="https://cdn2.iconfinder.com/data/icons/circle-icons-1/64/power-512.png" style="width:30px;"></span>');
		$('#sellrewButtons').append('<span id="sellrewSettings" style="cursor:pointer; filter:hue-rotate(100deg);"><img data-tippy-content="Настройки" class="hoverImage tip" src="https://cdn2.iconfinder.com/data/icons/circle-icons-1/64/gear-256.png" style="width:30px;"></span>');
		$('#sellrewButtons1').append('<span id="sellrewSelectAll" style="margin-left:10px; cursor:pointer; filter:hue-rotate(100deg)"><img data-tippy-content="Выделить всех" class="hoverImage tip" src="https://cdn2.iconfinder.com/data/icons/circle-icons-1/64/check-128.png" style="width:30px;"></span>');
		$('#sellrewButtons1').append('<span id="sellrewAddList" style="cursor:pointer; filter:hue-rotate(247deg) brightness(1.7) saturate(60%);"><img data-tippy-content="Добавить в список" class="hoverImage tip" src="https://cdn4.iconfinder.com/data/icons/keynote-and-powerpoint-icons/256/Plus-128.png" style="width:30px;"></span>');
	}
	$('#sellrewPanel').append('<div id="toggleBottom" style="cursor:pointer; border-radius:0px 0px 10px 0px; background-color:rgba(255, 255, 255, 0.1); margin-top:10px; margin-left:auto; margin-right:auto; text-align:center; color:#fff; font-size:9px; width:110px; height:15px;"></div>');
	$('#toggleBottom').append('<p style="cursor:pointer; position:relative; top:3px">▼</p>');
	//Оформление окна настроек
	$('#sellrewPanelSettings').append('<div style="font-size:14px; margin-top:10px; margin-left:auto; margin-right:auto; text-align:center; widtn:150px; height:15px; font-weight:bold; color:#fff">Настройки</div>');
	$('#sellrewPanelSettings').append('<div class="hoverImage" id="closeSettingsSellrew" style="position:absolute; top:5px; left:410px; cursor:pointer"><img width="15" src="https://cdn4.iconfinder.com/data/icons/web-ui-color/128/Close-128.png"></div>');
	/*---------------------------------------------------------------------------------*/
	//Окошко статуса
	$('#sellrewPanelSettings').append('<div id="sellrewModeStatus" style="width:395px; margin:10px 5px 0 10px; padding:5px 5px 8px 8px; border:1px solid white; border-radius: 5px; font-size:14px; color:#fff; text-align: center"></div>');
	$('#sellrewModeStatus').append('<p>Текущий режим: </p>');
	$('#sellrewModeStatus').append('<p>Место запуска: </p>');
	$('#sellrewModeStatus').append('<p style="display:none">Лошадей в списке: </p><a style="font-size:14px; font-weight:bold; color:#fff" id="clearListToSaleRewrite">Очистить список</a>');
	//Колонка 1: Выкуп и переименовка
	$('#sellrewPanelSettings').append('<div id="columnOneSr" style="float:left;"></div>');
	//Выкуп
	$('#columnOneSr').append('<div id="buyReserveOptions" style="width:185px; margin:10px 5px 0 10px; padding:5px 5px 8px 8px; border:1px solid white; border-radius: 5px; font-size:14px; color:#fff"></div>');
	$('#buyReserveOptions').append('<div style="margin:5px 0 0 5px" id="buyReserveOptions1"></div>');
	$('#buyReserveOptions1').append('<span class="tip" data-tippy-content="Выкупать лошадей из зарезервированных продаж"><input id="sellrewBuy" type="checkbox" style="position:relative; top:1px"></span>');
	$('#buyReserveOptions1').append('<span style="color:#fff; font-weight:bold; margin-left:5px; cursor:default;">Выкуп ЗП</span>');
	$('#buyReserveOptions').append('<div style="margin:5px 0 0 5px" id="buyReserveOptions2"></div>');
	$('#buyReserveOptions2').append('<span id="equusLabel" class="radio-1" style="color:#fff; cursor:default;">За экю</span>');
	$('#buyReserveOptions2').append('<span><input id="sellrewBuyEquus" class="radio-1" type="radio" style="position:relative; margin:0 5px 0 5px; top:1px"></span>');
	$('#buyReserveOptions2').append('<span id="passesLabel" class="radio-1" style="color:#fff; cursor:default;">За пропуски</span>');
	$('#buyReserveOptions2').append('<span><input id="sellrewBuyPasses" class="radio-1" type="radio" style="margin-left:5px; position:relative; top:1px"></span>');
	$('#buyReserveOptions').append('<div style="margin:5px 0 0 5px" id="buyReserveOptions3"></div>');
	$('#buyReserveOptions3').append('<span style="color:#fff; cursor:default;">Макс. цена:</span>');
	$('#buyReserveOptions3').append('<span style="margin-left:5px;"><input id="sellrewBuyPrice" style="max-width: 65px;" type="number"></span>');
	$('#buyReserveOptions3').append('<span style="margin-left:5px;"><img id="pictureValute" src="/media/equideo/image/fonctionnels/20/equus.png"></span>');
	//Переименовка
	$('#columnOneSr').append('<div id="rewriteOptions" style="width:185px; margin:10px 5px 0 10px; padding:5px 5px 8px 8px; border:1px solid white; border-radius: 5px; font-size:14px; color:#fff"></div>');
	$('#rewriteOptions').append('<div style="margin:5px 0 0 5px" id="rewriteOptions1"></div>');
	$('#rewriteOptions1').append('<span class="tip" data-tippy-content="Переименовывать лошадей"><input id="sellrewRewrite" type="checkbox" style="position:relative; top:1px"></span>');
	$('#rewriteOptions1').append('<span style="color:#fff; font-weight:bold; margin-left:5px; cursor:default;">Переименовка</span>');
	$('#rewriteOptions').append('<div style="margin:5px 0 0 5px" id="rewriteOptions2"></div>');
	$('#rewriteOptions2').append('<span style="color:#fff; cursor:default;">Завод:</span>');
	$('#rewriteOptions2').append('<span style="margin-left:5px;"><input id="sellrewFarm" style="width:103px; margin-left:22px;" type="text"></span>');
	$('#rewriteOptions2').append('<span style="color:#fff; cursor:default;">Аффикс:</span>');
	$('#rewriteOptions2').append('<span style="margin-left:5px;"><input id="sellrewAffixe" style="width:103px; margin:5px 0 0 7px;" type="text"></span>');
	$('#rewriteOptions2').append('<span style="color:#fff; cursor:default;">Имя муж.:</span>');
	$('#rewriteOptions2').append('<span style="margin-left:5px;"><input id="sellrewMale" style="width:103px; margin-top:5px;" type="text"></span>');
	$('#rewriteOptions2').append('<span style="color:#fff; cursor:default;">Имя жен.:</span>');
	$('#rewriteOptions2').append('<span style="margin-left:5px;"><input id="sellrewFemale" style="width:103px; margin:5px 0 5px 1px;" type="text"></span>');
	$('#rewriteOptions2').append('<span style="color:#fff; cursor:default;">Случайные имена</span>');
	$('#rewriteOptions2').append('<span class="tip" data-tippy-content="Называть жеребят случайными именами из списка"><input id="sellrewRandom" type="checkbox" style="position:relative; margin:0 5px 0 5px; top:1px"></span>');
	$('#rewriteOptions').append('<div style="margin:5px 0 0 5px" id="rewriteOptions3"></div>');
	$('#rewriteOptions3').append('<span style="color:#fff; cursor:default;">Добавить к имени:</span>');
	$('#rewriteOptions3').append('<select id="sellrewAddToName" style="margin-top:3px; width:175px; background-color:#fff"><option value="none">Не добавлять</option><option value="0">ГП ххххх.хх</option><option value="1">ГП хх.хх</option><option value="2">Навыки</option><option value="3">Редкая масть (1-5%)</option></select>');
	//Продажа
	$('#sellrewPanelSettings').append('<div id="sellOptions" style="float:left;width:185px; height:264px; margin:10px 5px 0 5px; padding:5px 5px 8px 8px; border:1px solid white; border-radius: 5px; font-size:14px; color:#fff"></div>');
	$('#sellOptions').append('<div style="margin:5px 0 0 5px" id="sellOptions1"></div>');
	$('#sellOptions1').append('<span class="tip" data-tippy-content="Продавать лошадей"><input id="sellrewSell" type="checkbox" style="position:relative; top:1px"></span>');
	$('#sellOptions1').append('<span style="color:#fff; font-weight:bold; margin-left:5px; cursor:default;">Продажа</span>');
	$('#sellOptions').append('<div style="margin:5px 0 0 15px" id="sellOptions2"></div>');
	$('#sellOptions2').append('<span><input id="sellrewAuction" class="radio-2" type="radio" style="position:relative; margin:0 5px 5px 0; top:1px"></span>');
	$('#sellOptions2').append('<span id="auctionLabel" class="radio-2" style="color:#fff; cursor:default;">Аукцион</span>');
	$('#sellOptions2').append('<br><span style="margin-left:5px;"><input id="sellrewAuctionEquus" min="500" max="1000000" style="min-width:80px; margin-left:13px;" type="number"></span>');
	$('#sellOptions2').append('<span style="margin-left:5px;"><img src="/media/equideo/image/fonctionnels/20/equus.png"></span>');
	$('#sellOptions').append('<div style="margin:5px 0 0 15px" id="sellOptions3"></div>');
	$('#sellOptions3').append('<span><input id="sellrewDirect" class="radio-2" type="radio" style="position:relative; margin:0 5px 5px 0; top:1px"></span>');
	$('#sellOptions3').append('<span id="directLabel" class="radio-2" style="color:#fff; cursor:default;">Прямые продажи</span>');
	$('#sellOptions3').append('<br><span style="margin-left:5px;"><input id="sellrewDirectEquus" min="500" max="1000000" style="min-width:80px; margin-left:13px;" type="number"></span>');
	$('#sellOptions3').append('<span style="margin-left:5px;"><img src="/media/equideo/image/fonctionnels/20/equus.png"></span>');
	$('#sellOptions3').append('<br><span style="margin-left:5px;"><input id="sellrewDirectPasses" min="10" max="2500" style="min-width:80px; margin:5px 0 0 13px;" type="number"></span>');
	$('#sellOptions3').append('<span style="margin-left:5px;"><img src="/media/equideo/image/fonctionnels/20/pass.png"></span>');
	$('#sellOptions').append('<div style="margin:5px 0 0 15px" id="sellOptions4"></div>');
	$('#sellOptions4').append('<span><input id="sellrewReserved" class="radio-2" type="radio" style="position:relative; margin:0 5px 5px 0; top:1px"></span>');
	$('#sellOptions4').append('<span id="reserveLabel" class="radio-2" style="color:#fff; cursor:default;">Резерв. продажи</span>');
	$('#sellOptions4').append('<br><span style="margin-left:5px;"><input id="sellrewReserveEquus" min="500" max="1000000" style="min-width:80px; margin-left:13px;" type="number"></span>');
	$('#sellOptions4').append('<span style="margin-left:5px;"><img src="/media/equideo/image/fonctionnels/20/equus.png"></span>');
	$('#sellOptions4').append('<br><span style="margin-left:5px;"><input id="sellrewReservePasses" min="10" max="2500" style="min-width:80px; margin:5px 0 0 13px;" type="number"></span>');
	$('#sellOptions4').append('<span style="margin-left:5px;"><img src="/media/equideo/image/fonctionnels/20/pass.png"></span><br>');
	$('#sellOptions4').append('<span style="margin-left:17px;color:#fff; cursor:default;">Для:</span>');
	$('#sellOptions4').append('<span style="margin-left:5px;"><input id="sellrewBreeder" placeholder="Имя игрока" style="width:90px; margin:5px 0 5px 1px;" type="text"></span><br>');
	$('#sellOptions4').append('<span style="margin-left:17px;color:#fff; cursor:default;">Для команды</span>');
	$('#sellOptions4').append('<span><input id="sellrewTeam" type="checkbox" style="margin-left:5px; position:relative; top:1px"></span>');

	$('#sellrewPanelSettings').append('<div style="clear:both;"></div>');
	//Выделять
	$('#sellrewPanelSettings').append('<div id="sellrewAmountOptions" style="width:400px; margin:10px 5px 0 10px; padding:5px; border:1px solid white; border-radius: 5px; font-size:14px; color:#fff"></div>');
	$('#sellrewAmountOptions').append('<div id="amountPanel" style="margin-left:60px;"></div>');
	$('#amountPanel').append('<p style="float:left;">Выделять</p>');
	$('#amountPanel').append('<span style="float:left; margin:0 5px 0 5px;"><input id="sellrewSelectAmount" min="1" max="200" style="max-width:40px; margin-left:5px;" type="number"></span>');
	$('#amountPanel').append('<p style="float:left;">шт. с лошади №</p>');
	$('#amountPanel').append('<span style="float:left; margin-left:5px;"><input id="sellrewHorseNumber" min="1" max="200" style="max-width:40px; margin-left:5px;" type="number"></span>');
	$('#sellrewAmountOptions').append('<div style="clear:both;"></div>');
	//Сбросить настройки
	$('#sellrewPanelSettings').append('<div style="margin-top:10px; margin-left:auto; margin-right:auto; text-align:center; widtn:150px; height:15px;"><a id="sellrewResetSettings" style="font-size:14px; font-weight:bold; color:#fff">Сбросить настройки</a></div>');
	/*------------------------------------------------------------------------------------*/
	//Смещение относительно других qually-скриптов, значок валюты в скрипте
	$(document).ready(function() {
		if (($('html[dir*="r"]').has($('.leftSidedPanel'))) && ($('.leftSidedPanel').eq($('.leftSidedPanel').length-4).attr('id') !== 'sellrewPanel')) {
			var top1 = $('.leftSidedPanel').last().css('top');
			if (top1 !== undefined) {top1 = Number(top1.replace('px', ''));}
			var height1 = Number($('.leftSidedPanel').eq($('.leftSidedPanel').length-4).height());
			var a = top1 + height1 + 20;
			$('#sellrewPanel').css('top', a + 'px');
			$('#sellrewPanelSettings').css('top', a + 'px');
		}
		if (set.sellrewBuyPasses == 1) {
			$('#pictureValute').attr('src', '/media/equideo/image/fonctionnels/20/pass.png');
		}
		if (localStorage.getItem('listToSaleRewrite') !== null) {listToSaleRewrite = localStorage.getItem('listToSaleRewrite').split(',');}
		refreshStatus();
		refreshAm();
	});

	var makeInputs = setInterval(function() {
		if (location.href.indexOf('elevage/chevaux/?elevage=') !== -1) {
			if (($('.chooseHorse').length == 0) || ($('.sellNumber').length == 0)) {
				var cells = $('li[class^="nowrap"]');
				for (var i = 0; i < cells.length; i++) {
					$('li[class^="nowrap"]').eq(i).parent().append('<p class="sellNumber" style="float:left; margin:5px 0 0 0">№' + (i+1) + '</p>');
					if (($('.header-logo').html().indexOf('vip') == -1) && ($('.header-logo').html().indexOf('pegase') == -1)) {
						var chooseId = $('li[class^="nowrap"] .horsename:eq('+i+')').attr('href').replace(/\D+/g,"");
						$('li[class^="nowrap"]').eq(i).parent().append('<span class="chooseHorse"><input id="'+chooseId+'" class="checkbox" name="chooseHorse[]" type="checkbox"></span>');
					}
				}
			}
		}
	}, 500);

	//radio
	$('.radio-1').click(function() {
		if (($(this).attr('id') == "sellrewBuyEquus") || ($(this).attr('id') == "equusLabel")) {
			$('#sellrewBuyEquus').prop('checked', true); localStorage.setItem('sellrewBuyEquus', '1');
			$('#sellrewBuyPasses').prop('checked', false); localStorage.setItem('sellrewBuyPasses', '2');
			$('#sellrewBuyPrice').val(''); localStorage.setItem('sellrewBuyPrice', '');
			$('#sellrewBuyPrice').attr('min', '500').change();
			$('#sellrewBuyPrice').attr('max', '1500000').change();
			$('#pictureValute').attr('src', '/media/equideo/image/fonctionnels/20/equus.png');
		}
		else {
			$('#sellrewBuyPasses').prop('checked', true); localStorage.setItem('sellrewBuyPasses', '1');
			$('#sellrewBuyEquus').prop('checked', false); localStorage.setItem('sellrewBuyEquus', '2');
			$('#sellrewBuyPrice').val(''); localStorage.setItem('sellrewBuyPrice', '');
			$('#sellrewBuyPrice').attr('min', '10').change();
			$('#sellrewBuyPrice').attr('max', '2500').change();
			$('#pictureValute').attr('src', '/media/equideo/image/fonctionnels/20/pass.png');
		}
	});

	$('.radio-2').click(function() {
		if (($(this).attr('id') == "sellrewAuction") || ($(this).attr('id') == "auctionLabel")) {
			$('#sellrewAuction').prop('checked', true); localStorage.setItem('sellrewAuction', '1');
			$('#sellrewDirect').prop('checked', false); localStorage.setItem('sellrewDirect', '2');
			$('#sellrewReserved').prop('checked', false); localStorage.setItem('sellrewReserved', '2');
		}
		else if (($(this).attr('id') == "sellrewDirect") || ($(this).attr('id') == "directLabel")) {
			$('#sellrewDirect').prop('checked', true); localStorage.setItem('sellrewDirect', '1');
			$('#sellrewAuction').prop('checked', false); localStorage.setItem('sellrewAuction', '2');
			$('#sellrewReserved').prop('checked', false); localStorage.setItem('sellrewReserved', '2');
		}
		else {
			$('#sellrewReserved').prop('checked', true); localStorage.setItem('sellrewReserved', '1');
			$('#sellrewAuction').prop('checked', false); localStorage.setItem('sellrewAuction', '2');
			$('#sellrewDirect').prop('checked', false); localStorage.setItem('sellrewDirect', '2');
		}
	});

	//Подсветка кнопок при наведении курсора
	var bLevel = 1;
	$('.hoverImage').on('mouseover', function() {
		bLevel += .1;
		$(this).css({"-webkit-filter" : "brightness("+bLevel+")"})
	});

	$('.hoverImage').on('mouseout', function() {
	    bLevel -= .1;
	    $(this).css({"-webkit-filter" : "brightness("+bLevel+")"})
	});

	$('div#toggleBottom').on('mouseover', function() {
		$(this).css('background-color', 'rgba(255, 255, 255, 0.2)');
	});

	$('div#toggleBottom').on('mouseout', function() {
	    $(this).css('background-color', 'rgba(255, 255, 255, 0.1)');
	});

	j = 2;
	var toggled = false;
	$('#toggleBottom').click(function() {
		$('#sellrewButtons1').slideToggle({duration:250, easing:'swing'});
		if (($('.leftSidedPanel').length == 2) || ($('.leftSidedPanel').last().prev().attr('id') == "sellrewPanel")) {
			if (toggled) {
				var animationCounter = 0;
				var timing = 1;
				$('#toggleBottom p').text('▼');
				var tim1 = setTimeout(function f1() {
					if (animationCounter < 41) {
						$('#sellrewPanel').height($('#sellrewPanel').height()-1);
						$('#toggleBottom').css('margin-top', Number($('#toggleBottom').css('margin-top').replace('px', ''))-1);
						$('#sellrewButtons1').css('opacity', Number($('#sellrewButtons1').css('opacity')) - 0.025);
						animationCounter++;
						if (animationCounter < 14) {timing-=0.7;} else if ((animationCounter >= 14) && (animationCounter < 28)) {timing+=0.7;} else {timing-=0.7;}
						setTimeout(f1, timing);
					}
					else {clearTimeout(tim1);}
				}, timing);
				toggled = false;
			}
			else {
				var animationCounter = 0;
				var timing = 1;
				$('#toggleBottom p').text('▲');
				var tim1 = setTimeout(function f1() {
					if (animationCounter < 41) {
						$('#sellrewPanel').height($('#sellrewPanel').height()+1);
						$('#toggleBottom').css('margin-top', Number($('#toggleBottom').css('margin-top').replace('px', ''))+1);
						$('#sellrewButtons1').css('opacity', Number($('#sellrewButtons1').css('opacity')) + 0.025);
						animationCounter++;
						if (animationCounter < 14) {timing-=0.7;} else if ((animationCounter >= 14) && (animationCounter < 28)) {timing+=0.7;} else {timing-=0.7;}
						setTimeout(f1, timing);
					}
					else {clearTimeout(tim1);}
				}, timing);
				toggled = true;
			}
		}
		else {
			if ($('.leftSidedPanel').eq(0).attr('id') == "sellrewPanel") {
				moveOtherWindows(j);
			}
		}
	});

	function moveOtherWindows(j) {
		if (toggled) {
			var animationCounter = 0;
			var timing = 1;
			$('#toggleBottom p').text('▼');
			var tim1 = setTimeout(function f1() {
				if (animationCounter < 41) {
					$('#sellrewPanel').height($('#sellrewPanel').height()-1);
					$('.leftSidedPanel').eq(j).css('top', Number($('.leftSidedPanel').eq(j).css('top').replace('px', ''))-1);
					$('#toggleBottom').css('margin-top', Number($('#toggleBottom').css('margin-top').replace('px', ''))-1);
					$('#sellrewButtons1').css('opacity', Number($('#sellrewButtons1').css('opacity')) - 0.025);
					animationCounter++;
					if (animationCounter < 14) {timing-=0.7;} else if ((animationCounter >= 14) && (animationCounter < 28)) {timing+=0.7;} else {timing-=0.7;}
					setTimeout(f1, timing);
				}
				else {
					j+=2;
					if (j < $('.leftSidedPanel').length) {moveOtherWindows(j);}
					clearTimeout(tim1);
				}
			}, timing);
			toggled = false;
		}
		else {
			var animationCounter = 0;
			var timing = 1;
			$('#toggleBottom p').text('▲');
			var tim1 = setTimeout(function f1() {
				if (animationCounter < 41) {
					$('#sellrewPanel').height($('#sellrewPanel').height()+1);
					$('.leftSidedPanel').eq(j).css('top', Number($('.leftSidedPanel').eq(j).css('top').replace('px', ''))+1);
					$('#toggleBottom').css('margin-top', Number($('#toggleBottom').css('margin-top').replace('px', ''))+1);
					$('#sellrewButtons1').css('opacity', Number($('#sellrewButtons1').css('opacity')) + 0.025);
					animationCounter++;
					if (animationCounter < 14) {timing-=0.7;} else if ((animationCounter >= 14) && (animationCounter < 28)) {timing+=0.7;} else {timing-=0.7;}
					setTimeout(f1, timing);
				}
				else {
					j+=2;
					if (j < $('.leftSidedPanel').length) {moveOtherWindows(j);}
					clearTimeout(tim1);
				}
			}, timing);
			toggled = true;
		}
	}

	if (sellrewStartup == 0) {$('#sellrewPower').css({"-webkit-filter" : "hue-rotate(280deg)"});}
	else {$('#sellrewPower').css({"-webkit-filter" : "hue-rotate(0deg)"});}

	$('#sellrewSettings').click(function() {
		$('#sellrewPanelSettings').toggle(0);
	});

	$('.hoverImage').focus(
		function(){this.blur();}
	);

	//Закрытие окна настроек нажатием на любое место документа
	$(document).click(function(evt) {
		if ((evt.target.id == "sellrewPanel") || (evt.target.id == "sellrewPanelSettings"))
			return;
		if (($(evt.target).closest('#sellrewPanel').length) || ($(evt.target).closest('#sellrewPanelSettings').length))
			return;
		$('#sellrewPanelSettings').hide(0);
	});

	function startUp() { //функция запуска работы скрита по нажатию на кнопку
		$('#sellrewPanelSettings').hide(0);
		if (sellrewStartup == 0) {
			$(this).css({"-webkit-filter" : "hue-rotate(0deg)"});
			sellrewStartup = 1;
			localStorage.setItem('sellrewWorkPlace', location.href);
		}
		else {
			$(this).css({"-webkit-filter" : "hue-rotate(280deg)"});
			sellrewStartup = 0;
			localStorage.removeItem('sellrewWorkPlace');
			localStorage.removeItem('affixesList');
			localStorage.removeItem('farmsList');
			localStorage.removeItem('listToSaleRewrite');
		}
		localStorage.setItem('sellrewStartup', sellrewStartup);
		location.reload();
	}
	//Нажатие на кнопку "Вкл/выкл"
	$('#sellrewPower').click(function() {
		if (mode == 1) {
			if ((location.href.indexOf('elevage/bureau/') !== -1) || (location.href.indexOf('/marche/vente/?type=prive&typeSave=1') !== -1) || (sellrewStartup == 1)) {
				startUp();
			}
			else {
				alert('Запуск скрипта по текущим настройкам производится со страницы офиса (вкладка "Коневодство" -> "Офис") или зарезервированных продаж (вкладка "Торговля" -> "Продажа лошадей" -> "Зарезервированные продажи").');
			}
		}
		else if (mode == 2) {
			if ((location.href.indexOf('/elevage/chevaux/?elevage') !== -1) || (sellrewStartup == 1)) {
				startUp();
			}
			else {
				alert('Запуск скрипта по текущим настройкам производится со страницы заводов (вкладка "Коневодство" -> "Лошади").');
			}
		}
		else {
			alert('Вы не настроили режим работы!');
		}
	});

	//Нажатие на "Выделить всех"
	$('#sellrewSelectAll').click(function() {
		if ($('.chooseHorse input:checked').length > 0) {
			for (i = 0; i < $('.chooseHorse').length; i++) {$('.chooseHorse input').eq(i).prop('checked', false);}
		}
		else {
			if (($('#sellrewSelectAmount').val() == '') || ($('#sellrewHorseNumber').val() == '')) {
				for (i = 0; i < $('.chooseHorse').length; i++) {$('.chooseHorse input').eq(i).prop('checked', true);}
			}
			else {
				for (i = Number($('#sellrewHorseNumber').val()) - 1; i < (Number($('#sellrewHorseNumber').val()) + Number($('#sellrewSelectAmount').val()) - 1); i++) {$('.chooseHorse input').eq(i).prop('checked', true);}
			}
		}
	});

	//Нажатие на "Добавить в список"
	$('#sellrewAddList').click(function() {
		if ($('.chooseHorse input:checked').length > 0) {
			var arr1 = $('.chooseHorse input:checked').toArray();
			for (i = 0; i < arr1.length; i++) {
				if ($(arr1[i]).attr('value') !== 'on') {
					arr1[i] = $(arr1[i]).attr('value');
				}
				else {
					arr1[i] = $(arr1[i]).attr('id');
				}
			}
			listToSaleRewrite = [...new Set(listToSaleRewrite.concat(arr1))];
			localStorage.setItem('listToSaleRewrite', listToSaleRewrite);
			refreshAm();
		}
		else {
			alert('Вы не выбрали ни одной лошади!');
		}
	});

	$('#clearListToSaleRewrite').click(function() {
		localStorage.removeItem('listToSaleRewrite');
		refreshAm();
	});

	$('#sellrewResetSettings').click(function() {
		for (i = 0; i < arr.length; i++) {
			localStorage.removeItem(arr[i]);
			location.reload();
		}
	});

	$('#closeSettingsSellrew').click(function() {
		$('#sellrewPanelSettings').hide(0);
	});

	//Нажатие на Сбросить настройки
	$('#sellrewResetSettings').click(function() {
		for (i = 0; i < arr.length; i++) {
			localStorage.removeItem(arr[i]);
			localStorage.removeItem('race-ane');
			localStorage.removeItem('sellrewWorkPlace');
			localStorage.removeItem('affixesList');
			localStorage.removeItem('farmsList');
			location.reload();
		}
	});
	$('#sellrewResetSettings, #clearListToSaleRewrite').on('mouseover', function() {
		$(this).css('color', 'red').change();
	});
	$('#sellrewResetSettings, #clearListToSaleRewrite').on('mouseout', function() {
		$(this).css('color', '#fff').change();
	});

	//Тултип
	tippy('.tip', {
		placement: 'bottom',
		duration: 0,
		animation: 'fade'
	});

	//Стили полей ввода и селектов
	$('#sellrewPanelSettings input').css({
		'background-color': '#555555',
		'border': '1px solid #a9a9a9',
		'color': '#ffffff'
	});
	$('#sellrewPanelSettings select').css({
		'background-color': '#555555',
		'color': '#ffffff'
	});

	//Загрузка настроек
	for (i = 0; i < inputs.length; i++) {
		if ((localStorage.getItem(inputs[i]) == null) || (localStorage.getItem(inputs[i]) == undefined)) {
			localStorage.setItem(inputs[i], "");
		}
		$('#'+inputs[i]).val(localStorage.getItem(inputs[i]));
	}

	for (i = 0; i < selects.length; i++) {
		if ((localStorage.getItem(selects[i]) == null) || (localStorage.getItem(selects[i]) == undefined)) {
			localStorage.setItem(selects[i], $('#'+selects[i]+' option:eq(0)').val());
		}
		$('#'+selects[i]).val(localStorage.getItem(selects[i])).change();
	}

	for (i = 0; i < checkboxes.length; i++) {
		if ((localStorage.getItem(checkboxes[i]) == null) || (localStorage.getItem(checkboxes[i]) == undefined)) {
			localStorage.setItem(checkboxes[i], '2');
		}
		if (localStorage.getItem(checkboxes[i]) == '1') {$('#'+checkboxes[i]).prop('checked', true);}
		else {$('#'+checkboxes[i]).prop('checked', false);}
	}

	//Установка настроек
	$('#sellrewPanelSettings input').on('keyup', function() {
		if ($(this).attr('type') !== 'checkbox') {
			localStorage.setItem($(this).attr('id'), $(this).val());
		}
	});

	$('#sellrewPanelSettings select').click(function() {
		localStorage.setItem($(this).attr('id'), $(this).val());
	});

	$('#sellrewPanelSettings input').click(function() {
		if ($(this).attr('type') == 'checkbox') {
			if ($(this).prop('checked') == true) {
				localStorage.setItem($(this).attr('id'), 1);
			}
			else {
				localStorage.setItem($(this).attr('id'), 2);
			}
			refreshStatus();
			refreshAm();
		}
	});

	$('.damier-cell').live('click', function(e) {
		if (($('.header-logo').html().indexOf('vip') == -1) && ($('.header-logo').html().indexOf('pegase') == -1)) {
			if (e.target !== $(this).find('.checkbox')[0]) {($(this).find('.checkbox'))[0].click();
		}
	}});
}
catch (e) {alert('Ошибка! Обратитесь к разработчику со скриншотом этого окна. Текст ошибки: Interface Error\n' + e);}
